{"meta":{"title":"IKEOVE","subtitle":"Like LiKe, Like like LIKE","description":"Like LiKe, Like like LIKE","author":"Ringo Hu","url":"https://ikeove.cn","root":"/"},"pages":[{"title":"Notice","date":"2020-05-04T20:18:45.000Z","updated":"2020-05-04T20:18:45.000Z","comments":true,"path":"about/index.html","permalink":"https://ikeove.cn/about/","excerpt":"","text":"Because of some unintentional inappropriate keywords maybe cause some trouble for the website, using English as a formal language partially in here considered be a rational choice, although I cannot handle it correctly. If you have any question about the contents posted in here, or there are some resources about the internet is hard to find for you, it will work that leaves it in the comment area or other way to contact me, do not forget to attach your email address. Thanks for your visit. Author CV: view"},{"title":"tags","date":"2020-05-04T20:18:30.000Z","updated":"2020-05-04T20:18:30.000Z","comments":true,"path":"tags/index.html","permalink":"https://ikeove.cn/tags/","excerpt":"","text":""},{"title":"archives","date":"2020-05-04T20:17:54.000Z","updated":"2020-05-04T20:17:54.000Z","comments":true,"path":"archives/index.html","permalink":"https://ikeove.cn/archives/","excerpt":"","text":""},{"title":"categories","date":"2020-05-04T20:18:15.000Z","updated":"2020-05-04T20:18:15.000Z","comments":true,"path":"categories/index.html","permalink":"https://ikeove.cn/categories/","excerpt":"","text":""}],"posts":[{"title":"3州放松封禁，全美COVID-19死亡人数已超50000","slug":"3州放松封禁，全美COVID-19死亡人数已超50000","date":"2020-04-25T12:00:00.000Z","updated":"2020-04-25T12:00:00.000Z","comments":true,"path":"2020/04/25/3州放松封禁，全美COVID-19死亡人数已超50000/","link":"","permalink":"https://ikeove.cn/2020/04/25/3%E5%B7%9E%E6%94%BE%E6%9D%BE%E5%B0%81%E7%A6%81%EF%BC%8C%E5%85%A8%E7%BE%8ECOVID-19%E6%AD%BB%E4%BA%A1%E4%BA%BA%E6%95%B0%E5%B7%B2%E8%B6%8550000/","excerpt":"APNEWS 2020/04/25 , Original link","text":"APNEWS 2020/04/25 , Original link 尽管全美确因新冠病毒死亡人数已飙升过50000，但佐治亚，俄克拉荷马和阿拉斯加在周五开始放宽针对流行病毒相关的封禁条令，虽然卫生专家警告这些逐步恢复正常的行为可能尚为时过早。佐治亚和俄克拉荷马的共和党州长允许沙龙，SPA和理发店恢复营业，而阿拉斯加则允许餐厅恢复堂食服务，零售店和其他商业在有序条件下重新开张。一些阿拉斯加的城市选择执行的政策更加严格。 尽管范围有限，而且还要遵守保持社交距离的限制，这些商业重启在全美乃至全世界范围内的有关政治领导人应多快解除重创经济的封锁命令的辩论中立下了标志性的里程碑。 随着其他州长要处理更加尖锐的问题，类似（放松封禁）的情景已在世界范围内上演并会迅速在美国扩散。他们的经济在因数周的隔离期而导致的失业和飙升的失业报告下连受重创，但卫生官员警告限制解除居家禁令可能会引发COVID-19的二次爆发。 在周五的白宫新闻发布会上，总统特朗普表示对经济持乐观态度，但依旧要求人们继续保持社交距离并佩戴口罩。 “我们正逐步唤醒我们的国家，这一幕实在让人激动”，特朗普说道。 新冠病毒在世界范围内已杀死超过190000人，其中包括截止到上周五所统计美国内的50000多人。这些数据来自于约翰·霍普金斯大学根据各国政府报告的数字所作的统计，真实的死亡总人数相信要高得多。随着较早期遭受打击的一些区域疫情平息，非洲和拉丁美洲的新病例却开始激增。 在俄克拉荷马州，州长凯文·斯蒂特授权开设个人护理业务，理由为因COVID-19而住院的人数有所减少。这些业务被要求继续保持社交距离，佩戴口罩以及频繁清洁设备。 但该州最大的一些城市包括诺曼，俄克拉荷马城和塔尔萨，依旧选择继续保持他们的禁令至少到四月底。 俄克拉荷马州西北部小镇费尔维的艾米·彭布鲁克和她的丈夫迈克在停业了大约一个月后重新开启了他们的美发沙龙。 “我们十分激动能重新开张，但也受到了些许那些认为还为时尚早的人的指责”，艾米·彭布鲁克表示，“我们只是说我们可以长期处于害怕之中，我们可以相信一切都会好起来的”。 由于佐治亚州的死亡和感染人数仍在上升，尽管州长布赖恩·坎普担保医院就诊人数和新确诊病例已降低到足够支持理发师，纹身师，按摩治疗师和私人教练在有序条件下复工，但许多商家仍计划继续关门。 即使对于特朗普来说，肯普的重启经济时间表也显得过于雄心勃勃。特朗普表示，他不同意这名共和党同僚的计划。 周五，特朗普签署了一项总额为4,840亿美元的法案，援助那些遭受大流行病压力的雇主和医院。这项最新联邦举措旨在帮助那些不得不关闭或缩减规模的企业继续经营。在过去的五个星期中，大约有2600万人申请了失业援助，约占美国劳工的六分之一。没有一项关于如何帮助国家摆脱新冠病毒封锁的行之有效的行动计划，世界处于多种政策的拼凑之中。一个国家的学校重开，另一些依旧关闭；一些地方强制戴口罩，另一些则只是建议。 在瑞典孩子们依旧参加足球训练，但在西班牙儿童甚至不被允许外出。当政府官员和科学家在与众多未知因素作斗争时，人们不得不去做出可能波及性命的决定。 在佐治亚州，萨凡纳的大卫·休恩的美甲沙龙有60名客户预约服务，但同一条街上的一家服装店，珠宝店和巧克力店却依然关闭。 “电话一直在响”，休恩说，“过去一个小时里我们可能接到了数百个电话”。 3月26日沙龙第一天开门时，就有四名戴着口罩的女士在外等候。 “是的，我已经准备好去修指甲了”，当地学校系统的警官艾莉娜·戴维斯表示，在整个危机期间她都在工作。 与此同时，尼基·托马斯早就该去找她的发型师了，但自开始在家工作的六周以来，她几乎没有离开房子冒险外出过。现在她并不会仅仅因为坎普的决定就去计划改变当下的状态。 40岁的托马斯在电话采访中说：“（坎普的决定）愚蠢至极，但同时我已精疲力尽了，以至于你无法直接看到我如此生气的模样”。 美国的新冠病毒检测依旧落后，（这种情况下却迎来）商业的逐步恢复。根据COVID追踪项目每日汇总的数据显示，截至此时，这个国家的3.3亿人口中只有不到470万人接受了检测。测试试剂和物资的缺乏从一开始就阻碍了美国的努力。周四约有193,000人接受了测试。这比过去两周的每日平均值163,000有所增加，但远远少于公共卫生专家所评估的应对病毒所需要的每日检测数。 哈佛大学的研究人员估计，为了保障经济安全重启，每天至少需要检测500,000人甚至更多。 在密歇根州，民主党州长格蕾琴·惠特默延长她的居家禁令直至5月15日，同时放松了一些限制以便一些商业能重启，公众能够参与例如高尔夫和摩托艇等户外活动。 密歇根州有近3000例与COVID-19相关的死亡，仅次于美国的纽约和新泽西州。 纽约周五报道了数周以来最低的每日COVID-19死亡人数。昨天的422人每日死亡记录是纽约州自3月31号以来的最小值，那一天的每日死亡记录为391人。疫情爆发以来，该州已有超过16000人死亡。 在丹佛，市长迈克尔·汉考克延长本市的居家禁令和非必要商业关闭至5月8号，而民主党同僚科罗拉多州州长贾里德·波利斯却准备在下周放宽一些州内限制。 科罗拉多州的卫生官员命令立即关闭丹佛郊区奥罗拉的沃尔玛，此前与该店有联系的三人因感染新冠病毒而死亡，同时至少有六名员工检测呈阳性。 法国自3月17日起实行全国禁闭，计划于5月11日开始解除禁令，之后政府将让家人决定是将孩子留在家中还是让他们重返课堂。在西班牙，父母面临着一个同样棘手的决定：在周日国家放宽全面禁令允许人们外出后，是否要让孩子们出门去享受数周内的第一口新鲜空气。 在杀死超过22500人之后，西班牙疫情扩散的速度正在放缓，这使得允许孩子出门的计划变得可行。周五西班牙卫生部门首次统计出，24小时内COVID-19康复人数多于新增人数。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"faceswap使用总结","slug":"faceswap使用总结","date":"2020-04-09T12:00:00.000Z","updated":"2020-04-09T12:00:00.000Z","comments":true,"path":"2020/04/09/faceswap使用总结/","link":"","permalink":"https://ikeove.cn/2020/04/09/faceswap%E4%BD%BF%E7%94%A8%E6%80%BB%E7%BB%93/","excerpt":"内容： 遇到的问题 关键步骤","text":"内容： 遇到的问题 关键步骤 遇到的问题： 安装程序执行失败。 下载程序实际上是分三部分下载，第一部分下载安装conda3，用以提供执行faceswap所需要的环境，这部分下载主要容易出问题的是网络速度慢，尤其在国内，解决的最好办法就是挂代理；第二部分是下载安装git，这部分我没有遇到过问题，而且git的作用也只是用来clone faceswap项目，是为第三部分服务的；第三部分就是从github clone项目文件， 这部分是我遇到最困难的部分，挂代理也不能解决，有一种方法可供参考： 修改C:\\Windows\\System32\\drivers\\etc\\hosts文件，在线查找github.com和github.global.ssl.fastly.net的IP地址，然后以192.30.xx.xx github.com的形式添加进hosts，接着使用ipconfig /flushdns刷新。由于IP地址时常更改，所以需要用时即时查找添加。 但这一方法也不总是有用，不排除是我的网络问题，后来在挂代理加修改hosts的双重作用下，且在深夜开始安装，第二天安装成功的可能性很高，这是我目前得到的最好办法了。 如还是一直失败，那么就需要考虑手动安装了，即先安装conda3，然后clone faceswap项目，再手动为faceswap创建conda3环境及安装依赖包，这一步就需要参考installer的源码来操作了。 实际上只要installer出现安装完成的提示，尽管日志中有一些错误，也是可以手动修复的。点击启动快捷方式，如果失败可根据启动日志来定位问题。如果是依赖包的问题可通过anaconda3命令面板手动安装；如果是Faceswap项目出错可独立clone一份下来，然后保留installer下载的faceswap项目文件夹中的启动文件faceswap_win_launcher.bat（实际上也可以自己写），其余的全部用独立clone下来的资源替代。 独立clone注意修改gitconfig中http的postBuffer = 524288000和sslVerify = false配置，项目实在太大，而国内网络环境又太差。 使用amd的用户可能会遇到启动失败的问题。可打开conda3命令面板，使用conda activate faceswap命令，激活faceswap环境，接着使用命令plaidml-setup，安装plaindml，注意选择正确的GPU（注意先要将显卡驱动更新一下）。 以上，就是从安装到开启面板中所遇到的问题。 开启faceswap面板后，执行时出现错误。 常见的错误可以通过日志查看原因，提示会告诉你大致的解决方向。 初次使用探测器，校准器，面罩等工具时需要下载资源包，这里需要挂代理，否则大概率失败。 我还遇到过无法检查更新的问题，排除网络原因后我手动pull了独立faceswap项目，然后替代了原有的就能解决。 除此之外还遇到过资源耗尽，文件不存在，图像尺寸不对等问题，这需要根据你自己的资源来采取行动。 关键步骤：实际上提取，训练，转换三部分，即联系又独立。联系是因为三者有明显的前后递进关系，独立则在于并不一定要求执行完前者才能进行后者，只要资源足够，三者可独立执行。 想要有一个好的转换结果，最重要的是拥有不同角度，不同光照，不同表情下的人脸图片，这是决定一切的关键。如何获取就是社会工程学的问题了。 注意，我有几个称呼对应： 图片&lt;-&gt;frame，即原始的照片或视频，这部分来源广泛，要求只有脸部区域尺寸应大于64*64px，其余没有任何限制。 人脸图像&lt;-&gt;face，即图片经过提取（extract）后生成的正方形人脸图像，人脸图像只在训练阶段有用。 校准文件&lt;-&gt;alignment，这个文件是作用在图片（frame）而不是人脸图像（face）上的，用于在图片上标出人脸的位置。 面罩&lt;-&gt;mask，这是包含在校准文件中却能对人脸图像起作用的标识，你可以将之视为调味品，有的话会更加鲜美，没有也不是不行。 提取阶段只需要大量的图片，论坛上要求图片数量为1000-10000之间，这里指的是可用的图片，重复，脸部模糊或太小都不能计算在内。有了图片后，提取就能生成人脸图像和校准文件。或许你还可以手动修正校准或合并多个校准，关于这部分的详细请参阅提取篇。 而在训练阶段，你需要的是人脸图像，只有在提取的过程中使用了面罩或warp to landmarks时，包含了这些信息的校准文件才有作用，也就是说，在训练过程中，主体是人脸图像，以及包含在校准文件中的面罩或warp to landmarks信息，而对于校准文件本身并不需要。顺带一提的是，面罩的使用好坏需要自己对照判断，而warp to landmarks我压根就没找到这个选项，不知道是不是移除了。训练阶段最终生成的是包含用于两张人脸的编码解码器，这是最需要花费时间的过程了，基本上是以天或周为计量单位的。 转换阶段你需要输入的就是你最终需要换脸的图片或视频了，譬如如果你需要更换一张图片中的人脸，那就输入图片；如果你需要更换一段视频中的人脸，那就输入视频。同时你还需要这张图片或视频的校准文件，考虑一下在此过程中校准文件里起作用的是哪一些信息呢？ 转换过程中，始终是将训练模型中的人脸B用于替代输入资源中的人脸。模型是转换的关键，而模型的关键在于用于训练的人脸图像，追根溯源，拥有充足资源的人脸图片才是效果好坏的根本因素。","categories":[{"name":"creature","slug":"creature","permalink":"https://ikeove.cn/categories/creature/"}],"tags":[{"name":"tool","slug":"tool","permalink":"https://ikeove.cn/tags/tool/"}]},{"title":"病毒致死区域减缓，但英国首相每况愈下","slug":"病毒致死区域减缓，但英国首相每况愈下","date":"2020-04-07T12:00:00.000Z","updated":"2020-04-07T12:00:00.000Z","comments":true,"path":"2020/04/07/病毒致死区域减缓，但英国首相每况愈下/","link":"","permalink":"https://ikeove.cn/2020/04/07/%E7%97%85%E6%AF%92%E8%87%B4%E6%AD%BB%E5%8C%BA%E5%9F%9F%E5%87%8F%E7%BC%93%EF%BC%8C%E4%BD%86%E8%8B%B1%E5%9B%BD%E9%A6%96%E7%9B%B8%E6%AF%8F%E5%86%B5%E6%84%88%E4%B8%8B/","excerpt":"APNEWS 2020/04/07 , Original link","text":"APNEWS 2020/04/07 , Original link 疫中纽约激增的新冠病毒死亡人数在周一似乎正趋于平缓，这种发展趋势与意大利和西班牙相呼应，但英国危机显著上升，英国首相鲍里斯·约翰逊在情况恶化后已被转移至重症监护室。首相办公室称，55岁的约翰逊当前意识清醒，还没有立即使用呼吸机。首相是当前世界上第一个感染新冠病毒的政府首脑。 美国总统唐纳德·特朗普称他已经要求“行业领先的公司”联系伦敦办公室提供可能有帮助约翰逊恢复的疗法，他称这些复杂的治疗手段为不出名的公司最近才开发出来的。 “我们已经和所有鲍里斯额医生取得了联系，所有人都知道将会发生什么，但他们都做好了准备”，特朗普对记者说。 总统表示缓解措施已经显现出了病毒蔓延减缓的迹象。政府分发了数百万的N95口罩，其他口罩，面罩，防护服和手套，但特朗普并未指明这些设备的去向。 纽约，州长安德鲁·库莫宣布了第一个疫情可能到达或接近峰值的微弱迹象，同时警告还不是放松保持严格社交距离限制的时机。他命令学校和非基础商业活动依旧关闭直到月底，并加倍对违反规则者的罚款至1000美元。 “数字上来看似乎它开始下降，‘哦，终于结束了！’，但还没有结束，其他地方已经犯了这种错误”，库莫表示美国死亡人数接近11000，还有超过365000例确诊病例。 国家顶级传染病专家安东尼·福西博士对于传播可能放缓保持谨慎乐观的态度，他表示在纽约，“我们的努力正在起作用”。 华尔街及美国以外的一些地方如意大利和西班牙的股票市场都在上涨。道琼斯工业平均指数上涨超过1600点，增幅接近8%。 但一些地方的疫情正变得更糟：法国报告了它自疫情开始的24小时最高死亡总数833例。日本由于世界第三经济体的地位和老龄化人口导致的感染数飙升，准备对东京和其他区域实行紧急状态。世界范围内，根据约翰·霍普金斯大学的数据，超过130万人确诊，致死人数超过7.4万。由于检测受限，不同的国家不同的死亡统计方式以及一些政府刻意的隐瞒，真实的数据一定会更高。 最新数据显示在一些国家保持社交距离这一方法正在起作用，而且比预期的要好。 一个来自于华盛顿大学的主流病毒爆发模型预计到8月初，美国大约会有8.2万人死亡，这比之前的预测人数要少12%，4月16号会出现日死亡人数最高的数字。该模型主要依赖来自于意大利和西班牙医院的可靠数据。 纽约州死亡人数上升至4700多，纽约市死亡总数接近9·11世贸中心事件死亡的2753人， 过去的四天里，纽约州平均每天有接近600人死亡。尽管令人震惊，但趋于平稳的每日死亡总数被视为一个积极的信号。库莫也表示每日医院新增人数和需要呼吸机的重症病人人数都在下降。 但医疗系统依旧紧张。为了提供帮助，特朗普表示一艘军用医疗船已被派往纽约市，现在已经能够接收COVID-19病人。库莫发twitter称美国海军船救助站会增加由联邦人员组成1000张床位，提供“紧急救助”。 全球范围内，奥地利和捷克共和国开始讨论如何解除一些限制，从下周重新开放一些小商店和公园开始。 英国死亡人数在周一攀升至400多人，总数接近5400人。周日尤其严重，死亡超过600人-这已超过意大利的记录。 意大利的每日COVID-19新增人数再次下降，为早期三周增长的日最小增幅。被病毒肆虐的意大利，由感染病人占用的重症监护病床也连续三天下降。 总理朱塞佩·孔戴对意大利人承诺他们会很快在个人自由方面“收获这些牺牲的果实”，尽管孔戴拒绝透露何时会解除封锁。 意大利也是世界上死亡总人数最多的国家-超过1.65万人-但北部的重症监护病房的压力已大幅度减轻，使得不再需要空运病人到其他地区。 贝加莫市疫中的教皇约翰二十三世医院，其护理协调员玛丽亚·贝拉德利表示。虽然新增病人略微减少，但医院医护人员依旧高强度加班轮换。 “工作没有减少，” 贝拉德利表示，“紧急病房的人数有所减少，但重症监护床位依旧全满，因此工作量并没有减少。” 西班牙，死亡和新增病例再次下降。卫生部报告了637例死亡，为13天里最低，总数增至1.3万多例死亡。新增病例也为两周内最低。 这表明西班牙进入了“战役的新阶段”，运输和交通及城市事务部长若泽·路易斯·阿巴洛斯表示。但“新阶段并不意味着我们可以放下警惕”。 世界各地都在重复警告，如果人民不继续遵守封锁规则，任何的收获都会被反转。联邦监察机构的一份报告显示，调查的美国医院超过3/4已经开始治疗COVID-19确诊及疑似患者。一些地方，如马里兰州，弗吉尼亚州和华盛顿特区，预计高峰期要到五月份甚至夏季才会到来。 路易斯安那州的巴吞鲁日报告称，因母亲感染病毒而带上呼吸机，一名女婴早产死亡。每年有数百万游客参观新奥尔良的路易斯安那州已有超过500例死亡病例。 然而，州长约翰·爱德华兹表示，本州的死亡和住院率可能显示感染正在放缓。 他说：“我们已开始观测到真实的迹象表明几周前采取的一些缓解措施开始取得实际效果。” 对于大多数人来说，病毒会引起轻度到中度的症状，如发烧和咳嗽。但是对于一些人，特别是老年人和免疫力低下的人来说，病毒会引发肺炎。全球范围内已有超过27万人康复。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"faceswap训练","slug":"faceswap训练","date":"2020-04-04T12:00:00.000Z","updated":"2020-04-04T12:00:00.000Z","comments":true,"path":"2020/04/04/faceswap训练/","link":"","permalink":"https://ikeove.cn/2020/04/04/faceswap%E8%AE%AD%E7%BB%83/","excerpt":"内容: 介绍 什么是训练？ 概览 术语 训练数据 选择模型 配置模型 设置 监督训练 停止与恢复 修复错误模型","text":"内容: 介绍 什么是训练？ 概览 术语 训练数据 选择模型 配置模型 设置 监督训练 停止与恢复 修复错误模型 注意：该文只保证写时有效（2019/09/29），作者尽量保存更新。 介绍大多数人在初学faceswap时总是不知所措，错误频出。犯错不是坏事，这是我们学习的方式，并且错误能让我们在深入理解之前更好的明白程序执行的过程。 这篇文章中我将会介绍如果训练一个模型。这里有许多模型，每个模型也有许多选项，我不会一一详述，但希望这些足够让你做出你自己的理智的选择。如果你还没有准备好为训练生成你的人脸数据集，那么暂且停止，先去回顾如何提取人脸数据集。 这篇文档里包含大量专业背景知识，我建议你首先对它们进行熟悉。机器学习是一个复杂的概念，但我会尽可能地拆解它们使其变得更加通俗易懂。对神经网络如何工作以及相关的数据的作用有一个基本的了解会大大提高你实现一个成功换脸的几率。 在此我使用GUI界面作用例，但在命令行操作模式下的原则也是一样的（所有GUI上显示的选项同样在命令行模式下也有设定）。 什么是训练？概览从最高层面上来看，训练是教会我们的神经网络（NN）如何去创造一张人脸的过程。大多数模型主要由两个部分组成： 编码器（Encoder）这是一个将大量的人脸数据作为输入然后将它们编码为一种以“向量（vector）”为格式的表现形式的过程。值得注意的是，这并不是在学习对输入的每一张人脸都能有一个精确的表示，而是试图创建一个算法以用于之后重建人脸时能尽可能地接近输入的人脸数据。 解码器（Decoder）这是一个试图将编码器创建出来的向量再解码为人脸的表现形式的过程，并尽可能地与输入的人脸相贴近。 一些模型的结构可能有些轻微的不同，但基本原则都是保持一样的。 神经网络需要知道怎样更好的对人脸进行编码和解码，通常使用以下两个主要工具： 丢失（Loss）对于输入模型中的每一批人脸数据，神经网络会对每一张人脸使用当前的编码和解码算法进行重新生成，然后与初始人脸进行比较。再根据自己的评估方式打出一个分数（丢失值），并相应的更新它的权重（weights）。 权重（Weights）一旦模型对重建的人脸的效果进行评估后，它就会更新权重。这些会反馈到编/解码算法中去。若权重始终朝一个方向变化，但对重建出来的人脸的评估结果不如之前，那么模型就会知道权重的调整方向错误，后面就可以往另外的方向调整权重了。如果评估的效果提升了，那么模型就知道后续应该继续往这个方向调整权重。 模型会重复多次上述过程，不断地根据丢失值更新权重，理论上会不断提升效果，直到你认为已经有足够多地学习足以有效地重建人脸，或丢失值停止下降。 现在我们对于神经网络做了什么以及它如何学习创建人脸有了基本地概念，那么如何将之应用到换脸中去呢？你可能注意到了，在上面地分析中讲到神经网络学习如何从一堆人脸数据中重建这些人脸，这不是我们想要的。我们想要的是从一堆人脸数据中重建其他人的人脸。为了达到这个目的，我们的神经网络需要做下面两件事情： 共享编码器（Encoder）当我们训练我们的模型时，我们输入了两组训练集。训练集A（我们想要替换的原始人脸）和训练集B（我们想放入视频中的交换人脸）。想要实现换脸的第一步就是共享训练集A和训练集B的编码器。其方法为用两组不同的人脸训练出同一个算法。这是尤其重要的，由于我们最终的目的是告诉神经网络将一张人脸的编码解码为另外一张人脸，编码器因此需要扫描和学习我们想要交换的两组人脸数据集。 交换解码器（Decoder）在我们训练模型时，我们训练出了两种解码器。解码器A用于将编码向量重建为人脸A,解码器B则用于将编码向量重建为人脸B。当进行最终的人脸交换时，我们交换解码器，由于编码器是用了两组人脸数据集进行训练的，所以模型会用编码器编码人脸A，但是后面会使用解码器B来重建人脸，最终在模型输出上就会导致人脸交换的效果。 术语有一些常见的机器学习术语你会在使用faceswap中见到。为了方便，先在这里展出一份词汇表： Batch（批次）：一个批次即同一次向神经网络输入的一组人脸数据集。 Batch Size（批尺寸）：批尺寸即一次向神经网络输入的人脸数据的个数。批尺寸为64意味着一次向神经网络输入64张人脸，丢失和权重的更新是以一批次的人脸数据来计算的。更大的批尺寸会让训练更快，同时也会带来更高的一般化。小的批尺寸会让训练变慢，但却能更好的分辨每张人脸之间的差异。在不同的训练阶段调节批尺寸是有好处的。 Epoch（时期）：一个时期即神经网络对输入的人脸数据进行一次完整的表达。例如，如果你有一个包含有5K张人脸的文件夹，一个时期即模型扫描了所有的5K张人脸，两个时期即模型扫描所有的5K张人脸两次。以此类推。就faceswap而言，时期并不是一个真正有效的策略。由于模型是要通过两组数据集来进行训练的（人脸A和人脸B），除非两组人脸数据集包含有完全相同的人脸个数（非常不可能），否则不可能在一个时期内就计算完拥有不同人脸数目的两组数据集。 Example（范例）：在faceswap中，范例即“人脸”的别称。本质上就是表示输入神经网络中的一张人脸。如果一个模型扫描了10个范例，也就是说扫描了10张人脸图像。 EG/s（每秒范例图形数）：每秒神经网络扫描的范例数，在faceswap中也就是表示模型每秒处理的人脸数目。 Iteration（迭代）：一次迭代即一个批次的人脸数据被神经网络处理了。批尺寸为64的10次迭代意味着有640张人脸数据被模型扫描过。 NN：神经网络的简称。 训练数据数据的质量对于你的模型的重要性是不可估量的。有了合适的数据一个小的模型也能有很好的表现，同样的，没有一个模型能在差数据的条件下产生好的效果。对于你的模型而言两边最少都要有500张不同的人脸图片。数据越多，差别越大，效果越好。需要指出一点的是，合理的图片数量应该是在1000到10000之间。超过这个界限的图片数量反而会伤害到训练效果。 太多相似的图片并不会有助于你的模型。你需要尽可能多的以不同的角度，不同的表情，以及不同的光照条件下拍摄的人脸图片。针对特定的场景来训练模型是一种常见的误解，这是一种“记忆化”，而不是你希望达到的效果。你需要训练模型从所有的角度，所有的表情以及所有的光照条件去理解一张人脸，然后用另外一张包含所有的角度，所有的表情以及所有的光照条件的人脸去替代它。因此，你需要从尽可能多的不同资源中去建立一个训练集，无论训练集A或训练集B都是如此。 不同角度的替代人脸和被替代人脸是至关重要的，神经网络只能从它看到的东西中学习。如果95%的人脸是直面摄像头而只有5%的侧面，那么模型将会花费很长时间去学习如何创建侧脸。如果它看到的侧面太少，可能都没有一点办法去创建侧脸。理想情况下你要尽可能地平均分配不同角度，不同表情以及不同光照条件下的人脸数目。 同样的重要地是，在训练集A和训练集B两边尽可能多地匹配角度/表情/光照条件。如果在训练集A中有大量地侧面图片而在训练集B中没有侧面图片，那么模型就会由于解码器B缺少信息而不能创建侧面镜头从而导致在侧面角度时就不能进行换脸。 训练数据的质量通常要求不能模糊，应保持高品质（清晰细致）。然而，训练集中有一些不清楚或部分模糊的图片也是可以的，在最终的换脸效果中也会有一些人脸变得不清楚/低分辨率/模糊。所以让神经网络看到的图片类型也是很重要的，它会对这些进行忠实的重建。 关于创建训练集的更多详情请参阅提取指导。 选择模型Faceswap上有许多可用的模型，并且更多的模型还在不断增加。每一个模型的质量是高度主观化的东西，因此这里只会对每一个（当前）可用的模型进行简短的介绍。你需要考虑多种因素来最终决定哪一个模型最适合你，因此这里没有绝对的答案。每一个都有其优缺点，但如前文所提到的，最重要的因素就是数据的质量，没有模型能处理数据问题。 你会看到上文提到的输入输出尺寸（例如64px输入/输出）。这是指输入模型人脸图像的尺寸和从模型中生成输出的人脸图像的尺寸。所有输入到模型的人脸都是方形的，因此一个64px的图片是高为64像素，宽为64像素。更高分辨率的输入会带来更好的换脸效果也是一个常见的误解。虽然有帮助，但并不是适用于所有的情况。神经网络是在学习如何使用一种算法来对人脸进行编码，再使用这种算法进行解码，这仅仅是需要足够的数据来创建一种稳固的算法。输入分辨率和输出质量没有直接的联系。 值得注意的是，模型越大，训练所需的时间越长。Original模型在使用英伟达GTX 1080的条件下进行训练通常需要12-48个小时，Villain模型在使用同一硬件的条件下所耗时间会超过一周。通常认为一个模型在两倍输入尺寸的条件下会花费两倍时间，但这是错误的，时间至少为原来的四倍甚至更久。这是由于一个64px的图像有4096个像素点，然而一个128px的图像有16384个像素点，是先前的四倍。除此之外，模型还需要额外处理增加的数据量，训练的时间也会迅速累增。 Lightweight（64px输入，64px输出） 这是一个极度精简的模型，设计用于在显存小于等于2GB的GPU上运行faceswap。这并不是所谓的“基础版本”，而是能让用户在低端硬件条件下去训练模型。在高端GPU上训练速度会非常快，这对于在进行更加复杂的模型训练之前先一步看到换脸效果的好坏是非常有用的。 Original（64px输入，64px输出） 这是最原始的模型。但依旧能提供很好的效果，并且能有效的让你理解数据集的质量的确是换脸效果的最大影响因素之一。 IAE（64px输入，64px输出） 这个模型的结构与其他模型略有不同。它是有一个共享的编码器和一个共享的解码器，但有三个中间层（一个对于训练集A，一个对于训练集B，一个共享）位于编码器和解码器之间。这种结构方式用于更好的分离特性。 Dfaker（64px输入，128px输出） 该模型在Original模型的基础上利用了一些不同的技术，特别是能将输入扩展为更高质量的输出。尽管该模型出来已经有一段时间了，却依旧能达到很好的效果，虽然缺少自定义选项但也使得它成为一种简单的“点击即用”的模型。 Unbalanced（64-512px输入，64-512px输出） 这是一个强大的模型，拥有大量的方式去自定义和提升模型，但这要求有许多的专业技能和知识去了解如何得到一个好的效果。实际上可以说已经被“RealFace”模型取代了。同时由于这个模型过于注重解码器B，以至于在反转交换（将人脸B替换人脸A，而不是将人脸A替换人脸B）时的效果不太好。 DFL-H128（128px输入，128px输出） 该模型实际上是和Original模型有完全相同的编码和解码器，但后面会使用128px的输入代替64px的输入，再将图像压缩为Original模型一半大小的人脸图像。更小的“隐含空间”在质量上与Original模型相比有一些下降，从而抵消了较大的输入尺寸。 DFL-SAE（64-256px输入，64-256px输出） 该模型包含了两个不同的网络结构，一个基于Original模型的共享编码器和独立解码器，另一个则基于IAE模型（共享中间层）。它拥有大量的自定义选项，提供更多的细节，但会导致一些特征痕迹（人脸A的一些特性可能仍然会留在已用人脸B替换的结果中）。 Villain（128px输入，128px输出） 该模型可能是最细致的模型了，但同时也会有更大的显存要求，并且在有限的资源上进行训练时能提供低标准颜色匹配（sub-par color matching）。著名的史蒂夫·布塞米（Steve Buscemi）/珍妮弗·劳伦斯（Jennifer Lawrence）的换脸视频就是使用了这种模型。由于该模型没有任何的自定义选项（除了一个低内存模式），所以如果你想不用任何设置就能得到一个很好的效果，那么该模型是一个适合的选择。 Realface（64-128px输入，64-256px输出） 该模型是Unbalanced模型的继任者。它借鉴了Unbalanced模型和Dfaker模型并在其上继续发展。该模型是高度可定制化的，但最好是在你明白你在做什么以及这些设置会有什么影响之后再来设置这些选项。和Unbalanced模型一样由于过于注重解码器B，以至于在反转交换（将人脸B替换人脸A，而不是将人脸A替换人脸B）时的效果不太好。 Dlight（128px输入，128-384px输出） 该模型是Dfaker模型的一个高分辨率变种，使用自定义扩展器专注于扩展人脸分辨率。该模型是最近才出现的同时非常容易配置。 配置模型好了，现在你已经选择了你的模型，让我们开始训练吧！等一等，我理解你急不可待的心情，但你首先可能需要去对模型的一些特殊选项进行设置。这里我会用GUI做示范，但配置文件（使用命令行）能在你的faceswap文件夹的faceswap/config/train.ini处找到。 我不会深入到每一个模型的选项，这里有那么多的模型并且实时为新模型进行更新是一件艰难的事情，但我会对一些常用的选项进行一个概述。主要针对会对所有模型都会产生影响的全局选项。所有的选项都有工具提示，将鼠标悬停在选项之上去得到更多的功能信息。 进入模型配置面板，Settings-&gt;Configure Train Plugins… Global 这里的选项将会对所有模型都起作用。 该页上的所有选项，除Learning Rate只在创建一个新模型时起作用之外，其余的所有被选定的选项在你开始训练一个模型时就会针对这个模型被“锁定”，之后所有的改变对于此模型无效，只有当你重新开始训练时设置才会被重载。 Face 作用于输入模型的人脸数据的选项 Coverage 这是资源图片输入到模型的量。图片以中心为基准裁剪出量给出的百分比。覆盖百分比越高，一张图片中输入到模型的人脸范围也就越大。100%即不加裁剪全部输入。 直觉上可能觉得高覆盖率总是好的，但并非如此。这是一个权衡过程。高覆盖率意味着人脸的大部分会被交换，但模型的输入尺寸总是固定的，由于更多的信息需要被包含在相同的尺寸图像中，故将导致最终的换脸结果缺少细节。 Mask 使用面罩进行训练的选项。 设置面罩是指出图片的那一部分区域是重要的一种方法。通常将人脸包含在面罩内以表示重要，其他部分放在面罩外作为无关紧要的部分。 使用面罩进行训练用于两个目的： 将训练专注在人脸区域，让模型更少关注背景。这能大大提高学习速度，同时确保不会占用空间去学习那些不重要的背景细节。 强化学习过的面罩还能用于转换阶段。虽然在当前的实现过程中，转换时使用强化学习过的面罩与标准面罩相比是否能提供更好的效果这件事是有争议的，但在训练时使用面罩起码保证了你有这个选择。 注意：如果你使用面罩来训练，那么无论是训练集A还是训练集B的文件夹中你都需要提供一个包含所有人脸的校准文件。 Mask Type 用于训练的面罩类型。使用面罩时你必须将你需求的面罩加入到校准文件中去。可以使用面罩工具进行增加或更新面罩。关于面罩的更多信息可参看提取教程。 Mask Blur Kernel 这用于轻微模糊面罩边缘。它将有效移除面罩的生硬边界，使得人脸与背景的边界变得更加的柔和自然。这有助于那些少量计算的面罩。是否开启以及设置什么值都取决于你。默认值也是可以的，你也可以使用Mask Tool去试验。 Mask Threshold 这个选项不会影响使用面罩的校准（extended，components），由于它们是二进制的（面罩只有“开”或者“关”）。而对于使用面罩的神经网络来说，由于面罩不是二进制并且有不同级别的不透明度，这个选项会导致面罩在某些情况下出现斑点。增加阈值使得面罩的部分变得接近透明，乃至完全透明，或者使得面罩的部分变得接近遮挡，乃至完全遮挡。同样的，这个数值也视情况而定。 Learn Mask 在早期，这个选项是否有益于面罩的强化学习是有争论的。开启这个选项会花费更多的显存，所以我倾向于关闭它，但如果你想在转换中使用这个预期的面罩，那么你应该开启这个选项。 Initialization 此处设置用于初始化你的模型。 正如在训练概览中提到的那样，模型会在每次迭代结束时更新权重。初始化则用于设置初始权重。你可将之视为在开始对模型提供的帮助。根据了解我们的神经网络将会用来做什么，我们来设置一个能帮助模型有一个好的起跳点的权值。 默认的初始化方法为“he_uniform”，这将从均匀分布中抽取样本。这里不会深入介绍不同的初始化方法并理解它们的功能，而只会涉及到本区域默认所显示的一些方法选项。 需要注意的是一些模型在内部为模型的某些层设定了初始化方式，所以这些层不会被此设置影响。但是对于那些没有进行明确设定的层和模型来说，其初始值会随着设定的选项而改变。 已存在的两种初始化方式能同时使用（同时使用不会有什么副作用）。我倾向于两者并用。 ICNR Init 该初始化方式仅用于扩展图层。标准初始化方式在使用神经网络进行扩展时会导致输出图片出现“棋盘”的人工痕迹。这种初始化方式就试图消除这种人工痕迹的出现。 Conv Aware Init 卷积感知初始化应用于模型内的所有卷积层。这种初始化方式背后的原理是它考虑到了卷积网络的目的并相应的初始化权重。理论上这将导致更高的准确性，更低的丢失以及更快的收敛。 注意：初始器在启动时会带来更多的显存消耗，因此建议先使用一个低批尺寸来启动模型，然后再用你想要的批尺寸来重启模型。 注意：初始器在多GPU条件下不可用，如果你使用多GPU进行训练，那么你应该先在单GPU上启动训练，然后停止模型，再使用多GPU方式继续。 Network 此处设置作用于模型中的图层。 这些选项可被模型中的一些图层所使用。 Subpixel Upscaling 这是神经网络内用于扩展图像的替代方法。它实际上和默认的像素改组层做了完全相同的工作，只是使用了不同的TensorFlow操作方式。由于并不会产生什么不同所以我建议将它关闭（未来可能会被移除）。 Reflect Padding 一些模型，尤其是Villain模型，和DFL-SAE模型的部分情况下，在最终换脸成果的交换区域边缘周边会出现明显的“灰框”。该选项修改卷积层中使用的填充类型以减轻这种人工痕迹。我只推荐在这两种模型中开启这个选项，其余情况关闭。 Loss 使用的丢失函数。 这里有很多不同的方法去计算丢失，对于神经网络来说要关心训练的模型效果怎么样。我不会过于详细的介绍每一个可用的函数，因为这将是一个漫长的过程以及关于这些函数在网络上有大量的信息。 Loss Function 最流行的丢失计算方法是MAE（Mean Absolute Error）和SSIM（Structural Similarity），个人更偏爱SSIM。 Penalized Mask Loss 这个选项决定是否对人脸区域之外的图像给予更少的关注，而注重于人脸区域之内的图像。该选项应始终设置为可用。 Optimizer 和优化器相关的选项。 优化器控制神经网络的学习速率。 Learning Rate 除非遇到模型崩溃（所有图像都变为纯色块，同时丢失处于高位且无法恢复），否则一般保持默认不做理会。不同于该页面上的其他参数，调节这个值能作用于已存在的模型。 学习速率决定了每次迭代权重上下调节的幅度。直觉上可能会说学习速率越高越好，但并非如此。模型的学习是为了尽可能的得到更低的丢失，而学习速率太高将不断地在最低值上下波动导致不会学习任何东西，过低的学习速率又可能会让模型跌至谷底进而认为已经到达最低点导致停止提升。 你可以想象为下山。你想到达最低点，因此你一直往下走，然而，下山的路并不全是下坡，路上还有许多小的丘陵和山谷，学习速率需要足够高以便能够跨过这些小的山谷，但又不能太高以至于一下子跳到了下一座山的山头（即把最低点也当作山谷跳过去了）。 Model 这里的设置是单独针对每一种模型的。 与之前提到的一样，我不会详细介绍模型的每一项配置。插件与插件之间千差万别。但是我会介绍那些你可能在各种插件中常见的选项。一如既往的，每个选项你都能从工具提示中获取更多信息。 Lowmem 一些插件有“低内存”模式，允许你在更少的显存条件下运行模型的精简版本，但代价是质量会更差。 Input size 一些插件允许你调节输入模型的图片尺寸。输入图片永远是正方形，因此这个尺寸为输入模型的图片的宽或高的像素值。不要相信大尺寸输入就等于更好的质量，并非永远如此。一个模型能否有一个好质量也是由许多其他的因素来决定的。而更大的输入尺寸会在处理过程中对于显存的要求有指数级的增长。 Output size 一些插件允许你调节模型生成的输出图片的尺寸。输入尺寸和输出尺寸不要求一样，因为一些模型包含有扩展器能返回尺寸大于输入图片的输出图片。 Trainer 配置设置页面的最后一个标签页是用来设置训练器的，又叫“数据强化”选项。 一个神经网络需要扫描很多很多不同的图片，为了更好的学习人脸它会在输入的图片上面进行多种操作。这即称为“数据强化”。和提示中讲到的那样，标准设置适用于99.9%的情况，所以只有在你明白选项的具体作用的情况下才能去修改它们。 Evaluation 评估训练状态的选项。 Preview Images 这里设置用于交换的训练集A和训练集B显示在预览窗口上图片的个数。 Image Augmentation 这是施加在输入模型的人脸图片上的一些操作。 Zoom Amount 在输入到神经网络之前，对人脸进行放大或缩小的百分比值，帮助模型处理错误校准。 Rotation Range 在输入到神经网络之前，对人脸进行顺时针或逆时针旋转的百分比值，帮助模型处理错误校准。 Shift Range 在输入到神经网络之前，对人脸进行上下，左右偏移的百分比值，帮助模型处理错误校准。 Flip Chance 水平翻转脸部，帮助创建更多的角度以供神经网络用来学习。 Color Augmentation 这些强化作用于输入到模型的人脸图片的对比度/色彩，使得神经网络在色彩差异方面表现得更加优秀。 Color Lightness 对输入的图片进行上下调节亮度的百分比值，帮助处理不同的光照条件。 Color AB 调节训练集A/B里的人脸图片的CIE-L*a*b*颜色空间百分比值。帮助神经网络处理不同的色彩状态。 Color CLAHE Chance 调节图像的“对比度有限调节直方图均衡化（Contrast Limited Adaptive Histogram Equalization）”百分比值。CLAHE是一种尝试定位对比度变化的对比方法。帮助神经网络处理不同的对比度。 Color CLAHE Max Size CLAHE算法“网格尺寸”的最大值。这将应用于输入图像。更高的数值会带来更高的对比度应用。帮助神经网络处理不同的对比度。 一旦你设置好了你想要的模型配置，点击OK去保存这些配置以及关闭窗口。 注意：点击OK将会保存所有标签页的设置，所以请确保你认真的检查过。你可以点击Cancel去取消你的修改或者按Reset去恢复所有的设置值为默认状态。 设置现在你已经准备好了你的人脸数据，你也配置好了你的模型，是时候开始行动了！ 在GUI中点击Train标签页：在这里我们告诉faceswap资源的存储位置，使用的模型，然后真正的开始训练。 Faces 这里设置人脸数据集的存储位置，以及它们各自的校准文件（如果需要）。 Input A 这里设置你提取过程中获得的人脸A的训练集的文件夹位置。这些人脸会从原始场景中被移除然后使用交换的人脸替代。这个文件夹中应包含大约1000-10000张人脸。 Alignments A 如果你使用面罩或者“”Warp to Landmarks”进行训练那么这里就需要指明你的人脸数据A的校准文件，这个文件会在提取过程中被生成。如果这个文件存在于你的人脸数据文件夹且命名为“alignments.json”，那么程序会自动选择它。必需保证人脸A数据文件夹中的每一张人脸都在校准文件中包含有其信息，否则训练会失败。因此你可能需要合并一些校准文件。关于如何为训练准备校准文件的更多信息请参考提取指导。 Input B 这里设置你提取过程中获得的人脸B的训练集的文件夹位置。这些人脸会替代原始场景中的人脸。这个文件夹中应包含大约1000-10000张人脸。 Alignments A 如果你使用面罩或者“”Warp to Landmarks”进行训练那么这里就需要指明你的人脸数据B的校准文件，这个文件会在提取过程中被生成。如果这个文件存在于你的人脸数据文件夹且命名为“alignments.json”，那么程序会自动选择它。必需保证人脸B数据文件夹中的每一张人脸都在校准文件中包含有其信息，否则训练会失败。因此你可能需要合并一些校准文件。关于如何为训练准备校准文件的更多信息请参考提取指导。 Model 这里设置你想要训练的模型的有关选项。 Model Dir 模型保存的位置。选择一个空文件夹保存新的模型。也可以选择一个已包含模型的文件夹以重启训练。 Trainer 你想用来进行训练的模型。前文已经介绍了。 Allow Growth 英伟达专用。允许TensorFlow GPU使用“allow_growth”的配置选项。此选项阻止TensorFlow在启动时就分配全部的GPU显存，但会导致显存碎片化和性能降低。只有当你在训练时遇到问题（尤其是cuDNN错误）才开启。 Training 训练专用设置。 Batch Size 前文有解释，批尺寸是一次输入模型的人脸图像数量。提高该值会增加显存使用但能一定程度上加速训练。降低该值能提供一种调整规则帮助模型更好的概括人脸。尽管大的批尺寸能加快训练，但8-16范围内的批尺寸数值似乎能产生更好的质量。是否另外的调整规则能替代或消除这种需求依旧是一个悬而未决的问题。 Iterations 自动停止训练前的迭代次数。这仅仅是为了自动化或者保证训练能在一定次数后停止。但通常你会在预览的效果达到预期而手动停止训练。 GPUs 英伟达专用。用于训练的GPU个数。如果你的系统中包含有多个GPU，你最多可以使用8个GPU来加速训练。但注意这个加速效果不是线性增长的，加入的GPU越多，新加入的GPU产生的效果就越少。后面它也允许你通过拆分到各个GPU中而增大训练的批尺寸。速度和显存数值最差的GPU将会成为你的瓶颈，所以最好的工作方式是在同样的GPU上进行训练。 No Logs 在TensorBorad和GUI上显示的丢失和模型日志能够用于分析数据。关闭这个选项将意味着你不再能获取到这些数据，实际上，没有任何理由去关闭记录，所以通常它不应该被勾选。 Warp To Landmark 和之前介绍的一样，数据被弯曲好让神经网络能够学习如何去重建一张人脸。弯曲地标是一种不同的弯曲方式，它尝试去随机化弯曲和另外一侧的数据集相似的人脸（例如从训练集A中发现了一张和训练集B中相似的人脸，然后就对它进行一些随机化弯曲）。这种方式与标准随机化弯曲相比有什么好处或不同目前尚无定论。 No Flip 随机翻转图像去帮助提高神经网络所看到的数据量。但由于人脸是不对称的，所以在某些情况下可能效果并不让人满意（例如一边脸上有痣）。通常情况下默认不勾选，或者只是在开始训练的时候不勾选，之后的过程中对于某些交换你可能想不翻转。 No Augment Color Facesawp进行颜色增强（前面介绍过）。这确实能帮助训练集A与B之间匹配颜色/光照/对比度，但有时候可能不希望如此，那时就可以禁用此项。 VRAM Savings 节约显存的优化设置（英伟达专用）。 Faceswap提供了一些节约显存的优化选项，以便能让用户在性能可能不太够的情况下进行训练模型。不幸的是这些优化目前只适用于英伟达的显卡。这可能是最后一根救命稻草。如果你能够在不开启这些选项的情况下以至少6-8的批尺寸进行模型训练，那么你就不需要开启这些选项，因为会带来速度损失。所有选项都可独立作用，以节约堆栈空间。 Memory Saving Gradients MSG是一种在计算成本中节约显存的优化方案。理想情况下它能以提高20%的训练时间换来减少一半的显存消耗。这是你应该首先尝试的选项。 Optimizer Savings 通过在CPU而不是GPU上进行一些优化计算而节省出一笔可观的显存消耗。但这同时会增加系统内存消耗和降低训练速度。这应该是你尝试的第二选项。 Ping Pong 这是被逼无奈下最后也是最差的办法，但或许会对你有用。这本质上是将模型一分为二，一次只训练一半的模型。能够节约40%的显存消耗但会花费超过两倍的时间来训练模型。这应当是你最后考虑的选项。 注意：TensorBoard的记录和绘图功能在开启此选项的条件下不可用。 注意：预览图界面不再显示图片直到模型的两部分都已完成了一轮训练。 Saving 计划保存模型文件的选项。 Save Interval 多久保存一次模型到磁盘。当模型在保存时不会进行训练，因此你可以通过提高该值以得到略微的训练速度提升（这样就不用频繁等待模型被写入磁盘）。但该选项作为你的“故障保护”或许你也不应该将数值调得太高。如果一个模型在训练过程中崩溃了，那么你就只能从上次保存的地方继续。 注意：如果使用了Ping Pong显存节省选项，那么你不应该将此值设置高于100，因为这样可能会伤害到最终的效果。 Snapshot Interval 快照是模型在某一个时间点的复制。如果你不满意模型当前的发展方向那么快照允许你回滚到一个早期的时间点的快照，或者在你的模型保存文件错误且没有备份的情况下通过快照回滚。由于创建快照点需要一些时间且期间模型不会进行训练，所以通常应当设置一个较高的值（默认值适用于大多数情况）。 Preview 显示训练进程预览窗口的设置。 如果你是使用GUI那通常你不需要进行这些设置。预览是用来显示训练进程的一个弹出窗口。而GUI模式已经将这些信息嵌入到了“Display”面板，弹出的窗口只会显示完全相同的信息故而显得多余。预览将会在每次迭代保存时更新。 Preview Scale 由于弹出的预览会自适应训练图像的尺寸，如果训练图像为256px，那么完整的预览窗口将会达到3072*1792，这对于大多数显示器来讲都过大，因此这个选项用于按百分比缩小预览。 Preview 勾选使能弹出预览窗口，不勾选则禁止弹出预览窗口。对于使用GUI的情况则通常不需要勾选。 Write Image 这能将预览图片写入facesawp文件夹。用于在没有显示器的设备（例如远端服务器）上进行训练。 Timelapse 用于生成一组可选的延时图像的设置。 延时选项是一个可选的特性，能够让你看到训练过程中人脸随时间的变化。每次保存迭代时就会及时的保存一张展示当前训练进度的你选择的人脸图像。请注意延时图像所占用的磁盘空间会随着时间累计。 Timelapse Input A 一个包含你想用来生成训练集A（原始人脸）的延时图像的人脸数据文件夹。只有前14张人脸数据会被使用。你也可以直接指向训练集A的文件夹，如果你希望选择训练集A的前14张人脸作为输入。 Timelapse Input B 一个包含你想用来生成训练集B（交换人脸）的延时图像的人脸数据文件夹。只有前14张人脸数据会被使用。你也可以直接指向训练集B的文件夹，如果你希望选择训练集B的前14张人脸作为输入。 Timelapse Output 保存生成的延时图像的文件夹。如果你填了前两项但是此项留空，那么默认会用你保存模型的文件夹。 Global Faceswap全局选项。 这里的选项对于faceswap的每个部分都有用而不只是用于训练。 Configfile 你可以指定一个自定义的train.ini文件而不是使用保存在faceswap/config文件夹中的文件。如果你需要在很多已知的不同的好配置中间进行切换，那么这个选项是对你有用的。 Loglevel Faceswap日志记录的级别。通常应设置为INFO等级。只有在开发者需求的条件下你可以将其设置为TRACE等级，这会明显的降低训练速度且生成大量的日志文件。 注意：控制台只会显示到VERBOSE级别的信息，DEBUG和TRACE级别的信息只会写入日志文件。 Logfile 默认日志存储在faceswap/faceswap.log文件中，如果你愿意你也可以指明一个不同的位置。 一旦你设置且确定好了所有你想要的配置，点击Train按钮开始训练。 监督训练一旦你点击开始训练，训练进程将会花费一到两分钟去建立模型，预先加载数据然后启动训练。当训练启动后，GUI会进入到训练模式，底部将会出现一个状态栏，界面右侧将会出现一些标签页。 Status Bar 出现在底部右侧的状态栏会给出当前训练进度的一个预览，并会在每次迭代时更新。 你不需要太多关注这里的丢失数值。对于换脸来说它们是毫无意义的。这些数字只是显示了深度网络重建人脸A和人脸B的效果，但我们关注的是模型从人脸A的编码中建立人脸B的能力如何，而关于此效果的丢失值是不可能得到的，因为没有一个交换人脸的现实例子能供深度网络进行比较。 Elapsed 当前训练阶段已经过去的时间。 Session Iterations 在当前训练阶段中已经完成的迭代次数。 Total Iterations 针对该模型的所有训练阶段已经完成的迭代总数。 Loss A/Loss B 本次迭代的丢失。 注意：可能会有多个丢失值（例如人脸，面罩，多个输入等等）。该值为所有丢失的总和，因此这个数字差别变化会很大。 Preview Tab 可视化模型当前的状态。这里表示模型重建和交换人脸的能力，每次模型保存时更新。 了解模型是否完成训练最好的办法就是查看预览。这里会显示最终实际看起来的交换效果。当你对预览的效果感到满意时就可以停止训练了。像眼部光泽和牙齿这些精细的细节会是最后要完成的事情，一旦这些都被做好了，那么通常就表示训练基本上完成了。 预览将会显示12列，前6列表示训练集A（原始人脸），后6列表示训练集B（交换人脸），6列又会分为2组，每组3列。 组内第一列是未改变的输入模型图像。 组内第二列是模型尝试重建的人脸图像。 组内第三列是模型尝试进行交换的人脸图像。 这会以纯色块，或者非常模糊的色块作为开始，随着深度网络逐渐学习如何重建和交换人脸，效果也会随之提升。 红色的不透明区域表示面罩之外的人脸区域（如果使用了面罩进行训练）。 如果使用小于100%的覆盖率进行训练，你会看到一个红框的边缘，这表明这部分是“换脸区域”或是正被神经网络用于训练的区域。 你可以用底部右侧的保存按钮来保存当前预览图像的副本。 可以通过取消勾选底部右侧的“Enable Preview”选项来禁用预览。 Graph Tab 这个标签页包含了一个以时间为轴的丢失值图表。在每次模型保存时更新，你也可以通过点击“Refresh”按钮手动刷新。 你不需要太多关注这里的丢失数值。对于换脸来说它们是毫无意义的。这些数字只是显示了深度网络重建人脸A和人脸B的效果，但我们关注的是模型从人脸A的编码中建立人脸B的能力如何，而关于此效果的丢失值是不可能得到的，因为没有一个交换人脸的现实例子能供深度网络进行比较。 丢失值图表依然是一个有用的工具。只要丢失值在下降，那么就表明模型依旧在学习。模型学习的速度会随着时间逐渐降低，因此到最后可能很难辨别模型是否依旧在继续学习。这种情况下就可以看分析标签页了。 基于输出的数值，可能会有好几个图表可用（例如总计丢失，面罩丢失，人脸丢失等）。每一个图表会展示各自的丢失输出。 你可以用底部右侧的保存按钮来保存当前预览图表的副本。 可以通过取消勾选底部右侧的“Enable Preview”选项来禁用图表。 Analysis Tab 这个标签页显示了当前运行和之前训练阶段的一些统计信息。 有如下列元素： Graphs 点击蓝色图表图标打开选定的训练阶段图表。 Start/End/Elapsed 每个阶段各自的开始时间，结束时间和总训练时长。 Batch 每个阶段的输入批尺寸。 Iterations 每个阶段执行的总迭代次数。 EGs/sec 模型每秒钟处理的人脸图像个数。 当模型没有训练时，你可以通过点击底部右侧的“open”按钮打开模型文件夹，选择一个模型的state.json文件来查看之前训练的模型的信息。 你也可用通过底部右侧的“save”按钮来将分析标签页内的内容保存为CSV文件。 综上所述，丢失值图表对于查看丢失值是否下降有一定帮助，但当模型经过长时间训练后依旧难以分辨。分析标签页能给你一个更加详细的视图。 点击你最新训练阶段的蓝色图表图标会显示这个选定的阶段的训练图表。 选择“Show Smoothed”，将平滑值提高到0.99，点击“Refresh”按钮，然后就会放大最新的5000-10000此迭代。 现在图表已放大，你应该能够确定丢失值是否持续下降，或者它是否已“收敛（converged）”。收敛即指模型不再学习任何东西。 停止与恢复在GUI的底部左侧按一下“Terminate”按钮就可以随时停止训练，模型将会保存它当前的状态并退出。 配置相同的设置，以及将“Model Dir”设置为之前保存模型数据的相同文件夹就可以重启模型。通过GUI的”File”菜单或选项面板下的保存按钮来保存faceswap配置能让重启模型变得更加容易。 你能通过简单重载你的配置文件便开始继续训练。 训练文件夹里的人脸数据可以添加或删除，但请确保你在做任何改动之前先停止训练，然后再重启。如果你使用了“Warp to Landmarks”或面罩来进行训练，那么请确保你的校准文件也随着新增或删除人脸而进行了更新。 修复错误模型有时模型会崩溃，这可能由多种原因导致，但可以通过预览中的所有人脸变为纯色/混色块以及丢失值突增到高位而且无法恢复来判断模型的崩溃。 Faceswap提供了一个简单的工具来快捷修复模型。备份保存了每次丢失值总体下降的迭代记录。可通过以下步骤恢复备份： 从Tools菜单进入Restore标签页 设置Model Dir，这里选择你崩溃了的模型的存放位置。 点击“Restore”按钮，一旦修复完成你就可以从你最新的备份处继续训练。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"tool","slug":"tool","permalink":"https://ikeove.cn/tags/tool/"}]},{"title":"faceswap提取：一种工作流程","slug":"faceswap提取：一种工作流程","date":"2020-03-30T12:00:00.000Z","updated":"2020-03-30T12:00:00.000Z","comments":true,"path":"2020/03/30/faceswap提取：一种工作流程/","link":"","permalink":"https://ikeove.cn/2020/03/30/faceswap%E6%8F%90%E5%8F%96%EF%BC%9A%E4%B8%80%E7%A7%8D%E5%B7%A5%E4%BD%9C%E6%B5%81%E7%A8%8B/","excerpt":"内容： 介绍 为什么要提取？ 校准文件 提取 分类 清理校准文件 手动修正校准 启动手动工具 转换时手动修正 训练集手动修正 从校准文件中提取训练集 合并人脸数据集进行训练","text":"内容： 介绍 为什么要提取？ 校准文件 提取 分类 清理校准文件 手动修正校准 启动手动工具 转换时手动修正 训练集手动修正 从校准文件中提取训练集 合并人脸数据集进行训练 介绍很多人在开始换脸时总是不知所措，会犯下很多错误。犯错误是好事。这是我们的学习方式，错误有时能帮助我们在还没有深入研究之前更加有效的理解中间所涉及的过程。 这里我会详细介绍提取的工作流程。我没有说这种流程时最好的，也没有强迫你一定要这么做，只是这种流程适合我，也希望能提供一个对创造你自己的工作流程有帮助的起跳点。 在这篇教程中我会使用GUI模式，但理论流程和使用命令行模式是完全相同的（所有GUI上有的选项同样在命令行模式下可用）。 为什么要提取？从最高层面来看，提取包含有三个阶段： 检测，校准和面罩生成。每个过程都有很多插件可以实现，这些插件的详细优缺点可以在tooltips（GUI模式）或者帮助文本（命令行模式）中查看，所以我不会去详述细节。然而，检测是用一个方框去发现人脸的过程，校准是从人脸中寻找“地标”并保持人脸正向。最后的面罩生成则是创建一个“面罩”，去识别最终的人脸图像中哪些是人脸，哪些是背景或障碍物。 提取是为了两个主要目的： 为训练模型生成一组人脸（faces）数据集，以及可选的校准（alignment）文件和面罩（mask）。 为你的最终图片（frames）转换生成校准文件和面罩。 技术上来讲的第三个目的则是，当你在为了转换而提取的同时，部分人脸也会用于训练，这些我之后会介绍。 尽管在转换时（只需要校准文件）不需要这些提取出来的人脸数据，但获取它们依旧是有用的，这可以为转换过程清理我们的数据集。 校准文件校准文件拥有在每一张图片中找到的所有人脸的信息，尤其是脸在哪里，以及68个点地标在哪里。 它同样存储了每一张脸在提取过程中生成的所有面罩。 校准文件的目的分三个方面： 训练：如果“Warp to Landmarks”有效的话，它将提供人脸地标。 转换：它告诉转换程序在原始图片中需要被替换的人脸位于何处。 训练和转化：它存储的所有面罩可能会被用于这些过程。 现在我们知道了为什么我们需要提取人脸，那么我们该如何建立一个好的工作流程呢？ 提取第一步，无论你创建人脸数据集的原因是什么，实际上都是要从图片中提取人脸数据。 Data 这是设置输入视频或图片集，以及输出路径的地方。 Input Dir 首先我们需要资源。这里能选择一个视频文件或一个包含图片集的文件夹。 Output Dir 接着我们需要告知程序将提取出来的人脸数据放在何处。点击文件夹图标设置输出路径。 我忽略了下面的一些选项，所以你或许也应该如此，但下面会逐一介绍它们： Alignments 这个选项是为了万一你想特别指定一个不同的名字或路径来保存校准文件而设置的。留空是最简单的，以便让程序将校准文件保存在默认路径（即资源图片或视频的存放路径）。 Plugins 插件用于初次从图像中检测人脸，读取人脸地标以对齐图像，以及使用多种遮面方式创建一个面罩。 Detector, Aligner 选择一个你想使用的。在本文编写的时候（2019/07/20）最好的探测器是S3FD，最好的校准器是FAN。 Masker 选择一个你想使用的遮面器。它们各有优缺点，如果你希望使用一个面罩来训练或转换你的图片（推荐），那么你需要在此选择一个面罩。 提示：面罩是一个新增选项，所以尚没有足够的信息来判断哪一个最好。你可以在提取过程中只建立一个面罩，也可以选择建立多个面罩，或者往已存在的校准文件中新添加面罩，同时使用面罩工具生成预览。 None 不创建面罩 Components 通过在校准阶段找到的68个点地标来生成面罩。这是基于人脸边缘环绕点建立的多部分面罩。 Extended Components面罩最主要的问题是它会以眉毛作为人脸上界。Extended面罩基于Components面罩，但它尝试将额头包含进来以避免“双重眉毛”的问题（替代人脸和被替代人脸的眉毛都会在最终成像中显示）。 Unet-DFL 一种基于神经网络的面罩用于对大部分正面人脸进行智能分割。该模型已被社区成员做过训练。 VGG-Clear 一种基于神经网络的面罩用于对大部分没有遮挡物的正面人脸进行智能分割。 VGG-Obstructed 用于对大部分正面人脸进行智能分割。这种面罩模型被专门训练用于识别有一些人脸障碍物的人脸（手或者眼镜）。 Normalization 处理复杂光源条件下的图片以便提取器能更好的检测人脸。不同的的数据集有不同的正规化方法，但我发现“hist”是最全能的。这会略微降低提取速度，但能进行更好的校准。 下面的一些选项也可以忽略，但我同样会介绍它们的作用以便你能做出自己的选择。 Rotate Images 这个选项除了CV2-DNN探测器可能会用到之外，对于其他可选的探测器来说都是完全不需要的。当前的探测器都可以完美处理任意方向上的人脸检测，所以这个功能只会拖慢你的进程而不会有太大的收获。 Face Processing 在此处设置人脸过滤和选择的选项。 Min-size 我通常将此设置为一个大于零的较小值，去过滤那些显然太小而无法构成人脸的东西。然而这取决于输入图片的尺寸以及图片中人脸的尺寸。 我忽略了下面的一些选项，理由如之前一样，但是你可以自己选择。下面会逐一对其做出介绍： Filter/nFilter, Ref Threshold 这些选项是为了过滤掉不想要的人脸。我没有使用它而是宁愿在下一步中自己手动操作，与使用机器过滤相比手动操作往往更加有效，而且也花不了多少时间，但如果使用机器过滤则会大大拖慢提取的速度。 Output 设置人脸数据输出选项。 Extract Every N 这是第一个选项，根据你提取的目的做修改。 如果你提取用于转换，或者用于转换的同时部分人脸数据也用于训练，那么设置为1（每一图片都提取）。 如果你提取只用于训练，那么请设置为一个相应合理的值，这将取决于你每秒输入多少图片。相应的，若输入为25fps的视频，那么合理的值应在12-25之间（每半秒到一秒之间），如果少于这个范围，那么你可能最终会得到大量的相似人脸图片。你要从你的训练集中提取多少资源，你的最终训练集中要有多少人脸数据，以及你的源视频有多长，这些都是要考虑到的。最终的值要依具体情况而定。 同样的，下面的一些选项我依旧跳过，但介绍如下： Size 这是提取出来的人脸图片的尺寸。当前没有模型支持256px以上大小，所以设置默认即可。 Save interval 我没修改过它，但你也可以有自己的选择。 Debug Landmarks 在人脸上绘制地标，仅用于调试目的。 Run 现在我们已经准备好检查之前的设定并开始进行提取了。 点击Extract，等待提取完成，相应的校准文件也会生成。 分类现在我们已经提取完人脸数据了，接着需要清理数据集和校准文件。提取器准确的抓取了人脸，但它不是完美的，也会有一些错误，有些人脸没有被校准，也有一些人脸不是我们想替换的，在你的输出文件夹中你会找到许多这样不准确的人脸数据。 清理看起来是件麻烦事。但好在我们可以让事情变得容易起来。清理数据集最快和最简单的方法就是将这些人脸数据有效分类，然后删除掉我们不需要的那些。一定程度上来讲最好的分类方式就是“按脸分类”。 注意：按脸分类是受RAM限制的，它需要做大量的计算。我曾经尝试过在8G RAM上成功分类22K张人脸数据。如果你不得不去分类超过RAM限制的人脸数据，程序将自动切换至慢速模式，因此若你的RAM比较小，可以将数据集细分为子数据集。理论上n张图片需要(n^2×24)∕1.8大小的RAM空间，与此同时你还需要考虑到一些其他的RAM开销（如其他程序占用，图片加载到RAM中），但理论上30K张图片需要大约11G RAM。 在GUI上点击“Tools”标签并进入“Sort”子标签： Data 在分类之前，在这里我们设置之前提取出来的人脸数据集。 Input 设置你之前提取出来的人脸数据存放路径。 Output 这里应当设置为空，我们希望在原地分类。 Sort Settings 我们希望如何分类人脸数据 Sort By 设置“Face”，你可以忽略掉这个部分的其他选项。 Output 我们希望分类后的人脸数据如何输出 Final Process 确保设置为“Rename”。 Keep 确保这里未勾选。你可以将其他选项都留空，它们不会对重命名任务产生任何影响。 Settings 分类特殊设置 Backend 可设置为GPU。只有当有GPU存在且当前没有其他机器学习的任务（如训练）在GPU上运行时才可用，它能加速分类。其他选项都可留空。 Run 其他选项默认。现在我们准备好检查设置并开始执行分类了。 点击Sort开始分类。 程序将通过为每一张人脸建立特征来识别它，接着将相似的人脸聚集到一起。实际的聚类过程将不得不计算大量数据，因而也会需要较长时间。由于这个过程中没有可视化反馈界面，因而需要耐心等待。 一旦计算完成，你会发现99%的人脸被分到了一起，而那些无用的图片也聚集到了一块，现在你需要做的就是查找人脸数据文件夹并将那些你不想要的人脸数据删除。 清理校准文件现在我们删去了我们不想要的人脸数据且有了一个可用的数据集，下一步就需要清理校准文件了。为什么要这么做？这是因为那些我们不想要的人脸数据信息依旧保留在校准文件里，这些信息在后面可能会引起麻烦，使用集成的工具清理校准文件还能有额外的好处，即将人脸图片重命名为其原始文件名，这是一举两得。 选择“Tools”标签然后进入“Alignments”子标签： Job 这里是工具中所有可用的各种校准任务。 选择“remove-faces”。 Data 这些选择我们想要处理的资源的位置。 Alignments File 这里选择之前提取过程中生成的校准文件，位于与提取源视频文件同一文件夹或提取输入图片文件夹里。 Faces Folder 选择提取过程中的人脸数据输出文件夹（也就是用于分类的文件夹）。 该部分其他选项留空，这里不需要设置。 Run 其他选项默认。现在我们准备好检查设置并开始执行清理校准文件了。 点击Alignments开始，等待程序完成。 完成后你的人脸图片会被重命名为提取后默认的名字，并且所有的不准确人脸数据都会从校准文件中移除。 程序会备份旧的校准文件并存放在原处，且会将其重命名为已做清理的校准文件的名字后加“backup_&lt;时间戳&gt;”，若你确认新的校准文件正确无误，你大可以删除掉这个备份文件。 另外，如果你为了转换而进行提取（或者这个数据是被用于转换及训练），那么你可以完全删除掉你的人脸数据文件夹，这些后面都不再需要。如果你需要重新生成你的人脸数据集，你可以通过校准工具（提取任务）来重新生成。 手动修正校准好了，我们提取了人脸数据，我们清理掉了所有的废物，我们就真的完成了吗？先不要急，你当然可以直接进行下一步，但是你不想得到一个好的换脸或者一个完美的换脸吗？ 在接下来的任务中，手动操作是有用的： 去除一张图片中留下的“多张人脸”。 为那些没有进行校准的图片添加一些校准 修理错误校准图片。 我们从数据集中提取了什么，将决定我们要在这里做什么。如果我们仅仅只是为提取一个训练集，尽管检查已存在的校准文件以确保这些面罩被正确建立是个好主意，但你也完全可以跳过全部步骤。 如果是为了转换而进行提取，那么我们绝对想要最好的处理一张图片中的多个人脸，以及那些没有校准的图片，这些行为将会提高最终换脸的质量。只要你想，你可以修正任何劣质对准。 我不想过于详细的介绍如何使用手动工具，这些本身也可以写一篇指南了，但在弹出的窗口中已经写好了非常直观的指导。 启动手动工具选择“Tools”标签然后进入“Alignments”子标签，启动手动工具。 Job 这里是工具中所有可用的各种校准任务。 选择“Manual” Data 这些选择我们想要处理的资源的位置。 Alignments File 这里选择之前最后一步清理过后生成的校准文件，位于与提取源视频文件同一文件夹或提取输入图片文件夹里。 Frames Folder 选择提取过程中你的输入视频或者输入图片文件夹。 该部分其他选项留空，这里不需要设置。 Run 其他选项默认。现在我们准备好检查设置并开始启动手动工具了。 点击Alignments启动手动工具。 注意：Windows用户有时会遇到bug，手动工具开启后立即关闭。如果你遇到了这样的情况，在GUI的“Manual Tool”选项区勾选“Disable Monitor”。 为转换进行手动修正注意：按“m”键进行预览和编辑模式切换。 为转换进行修正我们需要处理以下情况： 多张人脸 按“s”直到跳转模式设置为“Multi-Faces”。 按“x”跳到下一张包含有多张人脸的图片。 点击你不想要的人脸并按“d”删除它们。 继续上述行为直到所有图片修正完毕 按“Space”保存你已修正的校准文件。 无脸图片 按“{”返回第一图片。 按“s”直到跳转模式设置为“no-faces”。 按“x”跳到下一张无脸图片。 如果你遇到一张检测为无脸图片但实际上有人脸，你可以点击人脸并用鼠标调整边界框，或者你也可以使用“c”或“v”键复制前/后图片的校准放到此图片来编辑。 重复上述行为直到所有图片修正完毕 按“Space”保存你已修正的校准文件。 修正校准 按“{”返回第一图片。 按“s”直到跳转模式设置为“has-faces”。 按“x”跳到下一张有脸图片。 如果校准看起来不正确，使用鼠标调整边界框来修正。 重复上述行为直到所有图片修正完毕 按“Space”保存你已修正的校准文件。 手动调节中你每次保存都会创建一个校准文件的备份，若你确定新的校准文件正确无误，可以删掉备份文件，它们位于和原始校准文件相同的文件夹。 为训练集进行手动修正注意：按“m”键进行预览和编辑模式切换。 为训练集进行修正我们需要处理以下情况： 修正校准 按“s”直到跳转模式设置为“has-faces”。 按“x”跳到下一张有脸图片。 如果校准看起来不正确，使用鼠标调整边界框来修正。 重复上述行为直到所有图片修正完毕 按“Space”保存你已修正的校准文件。 手动调节中你每次保存都会创建一个校准文件的备份，若你确定新的校准文件正确无误，可以删掉备份文件，它们位于和原始校准文件相同的文件夹。 一旦校准文件被修正，你需要重新生成你的人脸数据集。这是由于地标的移动相应的人脸图像也会改变，所以训练程序会找不到你修正后的人脸。 首先删除提取时你设置的输出人脸数据文件夹，你不再需要这些了。 下一步选择“Tools”标签进入“Alignments”子标签： Job 这里是工具中所有可用的各种校准任务。 选择“extract”。 Data 这些选择我们想要处理的资源的位置。 Alignments File 这里选择之前最后一步清理过后生成的校准文件，位于与提取源视频文件同一文件夹或提取输入图片文件夹里。 Faces Folder 选择一个空文件夹存放输出的人脸数据。 Frames Folder 选择提取过程中你的输入视频或者输入图片文件夹。 该部分其他选项留空，这里不需要设置。 Run 其他选项默认。现在我们准备好检查设置并开始启动手动工具了。 点击Alignments按钮重新提取人脸数据。 如果你打算使用面罩或者使用“Warp to Landmarks”来进行训练，那么从你的源图片路径复制校准文件到你新建的人脸数据文件夹中。 从校准文件中提取训练集现在你已清理了你的校准文件，你可能想用其中的一些人脸数据用做训练集，操作很简单。 选择“Tools”标签进入“Alignments”子标签： Job 这里是工具中所有可用的各种校准任务。 选择“extract”。 Data 这些选择我们想要处理的资源的位置。 Alignments File 这里选择之前最后一步清理过后生成的校准文件，位于与提取源视频文件同一文件夹或提取输入图片文件夹里。 Faces Folder 选择一个空文件夹存放输出的人脸数据。 Frames Folder 选择提取过程中你的输入视频或者输入图片文件夹。 该部分其他选项留空，这里不需要设置。 Extract 这里设置从校准文件中提取人脸的相关选项。 Extract Every N 这取决于你每秒输入多少图片。相应的，若输入为25fps的视频，那么合理的值应在12-25之间（每半秒到一秒之间），如果少于这个范围，那么你可能最终会得到大量的相似人脸图片。你要从你的训练集中提取多少资源，你的最终训练集中要有多少人脸数据，以及你的源视频有多长，这些都是要考虑到的。最终的值要依具体情况而定。 Size 这是提取出来的人脸图片的尺寸。当前没有模型支持256px以上大小，所以设置默认即可。 Align Eyes 我完全是无意间发现的这个选项，校准器已经校准了人脸，所以不再需要进一步的校准。 Run 其他选项默认。现在我们准备好检查设置并开始从已修正的校准文件中提取训练集放入我们设定的文件夹中了。 点击Alignments按钮提取人脸数据。 如果你打算使用面罩或者使用“Warp to Landmarks”来进行训练，那么从你的源图片路径复制校准文件到你新建的人脸数据文件夹中。 合并人脸数据集进行训练现在你已经得到了大量的人脸数据准备开始训练了，并且你也有了用于获取人脸数据的图片文件对应的一些校准文件。是否能够综合上述资源开始进行训练呢？当然可以。 预备工作 在合并校准文件前我们需要做一点准备工作： 首先将你想要用于训练的人脸数据从各自的文件夹复制到一个文件夹中（我们将这个文件夹称之“training”）。 将与上述人脸数据相关的一些校准文件复制到这个新的“training”文件夹中。 现在，在GUI上，选择“Tools”标签进入“Alignments”子标签： Job 这里是工具中所有可用的各种校准任务。 选择“merge”。 Data 这些选择我们想要处理的资源的位置。 Alignments File 选择进入你的“training”文件夹，按住shift键选择所有刚刚复制过来的校准文件。 Faces Folder 选择放置人脸数据的“training”文件夹。 该部分其他选项留空，这里不需要设置。 Run 其他选项默认。现在我们准备好检查设置并开始合并校准文件了。 点击Alignments按钮合并校准文件。 完成。 当程序完成后： 删除“training”文件夹中之前复制过来的所有校准文件 重命名“training”文件夹中新生成的校准文件并命名为“alignment.fsa”。 训练集准备完毕。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"tool","slug":"tool","permalink":"https://ikeove.cn/tags/tool/"}]},{"title":"faceswap安装指导","slug":"faceswap安装指导","date":"2020-03-28T12:00:00.000Z","updated":"2020-03-28T12:00:00.000Z","comments":true,"path":"2020/03/28/faceswap安装指导/","link":"","permalink":"https://ikeove.cn/2020/03/28/faceswap%E5%AE%89%E8%A3%85%E6%8C%87%E5%AF%BC/","excerpt":"faceswap forum","text":"faceswap forum 下载地址：Installer windows安装指导：安装方法在windows安装faceswap非常简单，windows安装程序会安装除开显卡驱动以外的一切。 如果你是使用显卡（推荐使用显卡，在CPU上运行faceswap会非常慢），那么确保你的驱动程序已更新。 下载faceswap安装程序。 运行你刚刚下载的faceswap安装程序。提示：windows智能屏幕可能会警告该程序包含恶意软件。由于安装程序需要从网络下载资源所以有时会引起这种错误预警。如果你仍然怀疑，则可以去查看源码并自己编译程序。 在硬盘上选择你想安装faceswap的位置并点击下一步。默认位置对大多数用户来说是适用的。 下一步自定义安装选项 安装界面会告知你哪些程序会被安装。如果在你的系统中没有检测到 Miniconda3和Git，那么会被额外安装，这些都是运行faceswap所必须的。 在Custom Items项选择你想安装的faceswap版本，正确选择是非常重要的。 如果你想在Nvidia显卡上运行faceswap那么选择“Setup for NVIDIA GPU”。 如果你想在AMD显卡上运行faceswap那么选择“Setup for AMD GPU”。 如果你没有显卡或者想在CPU上运行faceswap（不推荐）那么选择“Setup for CPU”。 “Environment Name”是用于运行faceswap的Conda环境名。在大多数时候你不需要修改而保持默认即可。需要注意的是已存在的同名Conda环境将会被删除。 最后一栏用于标识已经安装在你的系统中但是没有被程序检测到的AnaConda3/MiniConda3。如果你不明白这意味着什么，那么最好还是留空，否则填入包含有Conda程序的文件夹路径以避免重复安装MiniConda。 点击Install开始安装，这个过程将会持续一段时间但中间不再需要用户输入，所以你可以去休息一下。 安装程序会逐步显示一部分或者所有的剩余页面，这取决于要安装多少的额外程序。你可以在任何时候点击“”Show Details”去查看程序当前在干什么。需要注意的是详情窗口并不是实时更新的（这是安装程序的不足之处），所以不要怀疑它卡住了。通常会在所有部分都完成后更新。 Git 首先它会下载Git。 之后它会安装Git。 这将弹出另外的Git安装窗口。 MiniConda3 下一步它将下载MiniConda3 之后它将安装MiniConda3。这可能需要一会儿，并不会有反馈，所以耐心些。 Faceswap 现在它会在github上下载faceswap的最新版本。 一旦faceswap下载完成，安装程序将会初始化Conda确保它已更新，同时移除先前已存在的faceswap环境。 下一步会安装新的Conda环境用于执行faceswap，这需要一些时间。 最后会安装faceswap及其依赖包到Conda环境中，这将持续一会儿因为要下载大量资源，具体时间依赖于你的网络连接速度。 完成！现在你可以点击“Close”继续。如果安装程序因为一些原因失败，最大的可能性是网络故障。当失败发生时，先尝试重新运行安装程序，实在不行再提交错误。 安装程序将会创建一个快捷方式到你的桌面以允许你直接启动faceswap GUI。 Linux安装指导：安装方法在Linux安装faceswap非常简单，Linux安装程序会安装除开显卡驱动以外的一切。 我们推荐使用轻量发行版（例如Xubuntu），但安装程序在各种Linux系统上都是可用的。 如果你是使用显卡（推荐使用显卡，在CPU上运行faceswap会非常慢），那么确保你的驱动程序已更新。 下载faceswap安装程序。 打开命令行模式，切换至安装程序下载位置，然后执行bash ./faceswap_setup_x64.sh（不要使用sudo命令或在root用户下执行）。 faceswap图标后会跟随一些信息，确保你仔细阅读（特别是关于目标文件夹的用户许可部分）之后按Enter键继续。 Conda。Faceswap使用Conda处理所有依赖包的安装（git，cuda，tensorflow等等）并将这些程序及其环境包含在Conda环境之中以不影响系统的其余部分。 如果检测到了Conda已安装，那么会询问你是否使用这个之前安装的Conda，如果你选择YES，这将会选择之前的Conda。若你选择no，则将继续安装新的Conda。 选择新安装Conda之后，默认的Conda安装路径适用于99%的情况，如果你希望在其他地方安装Conda，请确保： 你的用户拥有你选择的安装位置的写权限。 你提供的路径名中不包含空格（这是Conda的限制不受我们控制）。 如果你乐于使用默认路径那么按Enter键继续。 你需要选择是否将Conda添加进PATH，这取决于你自己，但选择YES会让事情变得简单。它意味着你能直接在命令行中执行“Conda”命令，而不需要在“miniconda3”文件夹中查找可执行文件。按Enter键选择默认值继续或者按n键不将Conda添加进PATH。 faceswap是在“虚拟环境”中运行。这是通过一个python环境独立于系统其余部分以避免冲突。这个环境需要命名，默认的即可。但如果你有多个安装那么你需要为当前环境制定一个特别的名字。注意：如果你选择了一个已存在的环境名，原有的环境将会被删除（如果该情况发生，你会在开始安装之前得到通知）。按Enter键使用默认的“facesawp”命名或者输入你选择的名字。 faceswap 此路径为安装faceswap的位置。默认路径适用于99%的情况。但和安装Conda一样，如果你选择了自定义路径，请确保你的用户拥有你选择的安装位置的写权限。注意：如果给出的路径已经有文件夹存在，那么它将会被删除（如果该情况发生，你会在开始安装之前得到通知）。按Enter使用默认路径或输入你选择的路径。 faceswap能在Nvidia或AMD的GPU上运行，也可以在CPU上，安装哪一种软件取决于你在此选择哪一项，所以确保基于你的系统做出正确的选择。 安装后操作 如果你的系统有桌面环境，那么在这里你可以选择是否创建一个进入faceswap GUI的桌面快捷方式。这会使得你更容易打开faceswap，所以除非你有充分的理由不这么做，否则请在这里选择Y。 最后你可以检查你的选项，一切无误的话按Y开始安装，或者按Enter中止。 安装程序将会按照你预先的选择从网络下载资源并进行安装。一段时间之后faceswap将会安装完成，那么你就可以启动了。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"tool","slug":"tool","permalink":"https://ikeove.cn/tags/tool/"}]},{"title":"External website rally","slug":"External-website-rally","date":"2020-03-26T12:00:00.000Z","updated":"2020-03-26T12:00:00.000Z","comments":true,"path":"2020/03/26/External-website-rally/","link":"","permalink":"https://ikeove.cn/2020/03/26/External-website-rally/","excerpt":"Some website usefully","text":"Some website usefully Navi Description 浙江图书馆 维普万方免费获取 威利在线图书馆 免费的外文期刊数据库，但量比较小 中华诗歌库 古文汇总 工信部申诉中心 没卵用的情况下当个球用 TrackCorona 显示新冠病毒全球状态 EIBOT 上个世纪建立的对话机器人项目，早期使用匹配方式，现在采用Teneo RSSHub RSS订阅集合 搬瓦工 一家VPS服务商 美加短信接收 提供美国/加拿大临时号码接收短信 辐射避难所改挡 WinStore商店版dweller存档修改 海盗湾 自由下载 可汗学院 自由在线教育，中文版只有初等教育 3Blue1Brown 优秀数学教学者","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"resource","slug":"resource","permalink":"https://ikeove.cn/tags/resource/"}]},{"title":"新冠病毒：学校关闭焦虑下承诺的答案","slug":"新冠病毒：学校关闭焦虑下承诺的答案","date":"2020-03-19T12:00:00.000Z","updated":"2020-03-19T12:00:00.000Z","comments":true,"path":"2020/03/19/新冠病毒：学校关闭焦虑下承诺的答案/","link":"","permalink":"https://ikeove.cn/2020/03/19/%E6%96%B0%E5%86%A0%E7%97%85%E6%AF%92%EF%BC%9A%E5%AD%A6%E6%A0%A1%E5%85%B3%E9%97%AD%E7%84%A6%E8%99%91%E4%B8%8B%E6%89%BF%E8%AF%BA%E7%9A%84%E7%AD%94%E6%A1%88/","excerpt":"BBC 2020/03/19 , Original link","text":"BBC 2020/03/19 , Original link 在受到缺乏透明度的批评之后，政府承诺将会提供更多关于学校关闭将会如何影响学生和家长的细节。教育部长表示，在新冠病毒危机期间，“核心工作者”的孩子依旧可以去上学，这份名单稍后将会公布。 他同时表示，如何在考试缺席的条件下为学生评估分数的详细办法将会在周五给出。 自此之前，英格兰和威尔士已经取消了GCSEs和A-Levels。 英国高校表示学生们不会因为此次行动而失去在今年上大学的机会。 在苏格兰有关考试的更多情况将会在苏格兰议会之后被宣布。苏格兰教育大臣约翰·斯威尼表示考试能够如期举行或者重新计划。 北爱尔兰在宣布它的第一例病毒致死案例后，应该也会采取相应的措施。 英国学校将会在周五关闭，但会接收弱势群体学生以及核心工作者的孩子。 教育部长加文·威廉姆森告诉BBC早报，内阁将在稍后公布核心工作者的详细名单，没有在名单上的家长们应当“立即意识到”他们的孩子将不被允许继续呆在学校。 他表示，这份名单将包括NHS工作人员，学校职工和货运司机。 学校和高校领导者协会秘书长杰夫·巴顿表示，他预计在九月份之前学校不会再度开放。 他说：“病毒的高峰期预计在大多数学校开始关闭之后的考试周，所以不太可能学校会在夏季学期重新开放。” 在考试取消的问题上，威廉姆森先生表示预期将在八月份通过“不同的程序和不同的制度”为在英格兰和苏格兰的孩子们打分。 然而他同时表示，由于“我们不知道病毒的蔓延将会如何影响考试委员会和那些打分的人”，因此不能“完全保证”分数能够在八月份发放。 英格兰和苏格兰本学年的考试原计划在5月和6月举行。 学校因保障关键工作者的孩子而开放预期会持续到复活节假期，官员们正在考虑将哪些人划归到关键工作者之中。 威廉姆森先生表示政府将会为那10%依旧要上学的孩子们提供一个“教学环境”。 教职工和学生可能会被要求去不是他们本来的学校里工作和学习。 托儿所，私立学校和（中学）六年级同样被告知要遵照规定关闭。 卫生官员们一直建议政府强制关闭学校。他们一贯坚持的观点是，因孩子在校外聚集，而让包括健康工作者的父母们可能不得不从工作中抽出时间来照看孩子，或者是让那些卫生人员一直试图保护的本就是易感人群的祖父们去照看孩子，这种情况会让我们试图去减少15%的感染峰值而做的努力付诸东流。 更重要的是，儿童是最不容易产生严重症状的年龄群，只有0.2%的病例在医院确诊。 最终无疑将会导致两个结果： 首先，这些行动足以保证NHS不会如同帝国理工学院在周一发布的新模型所预测的那样被患者淹没。 再者，更加确定的是，越来越多的学生和老师将会不得不待在家里与课堂隔离，同时无论接下来会采取什么行动，接下来的几个月考试将会被严重中断。 英国大学首席执行官阿里斯泰尔·贾维斯表示，如果能建立一种合理评估学生的方法——例如联合教师评价和之前的作业情况——那么成绩将能在夏季发布。他告诉BBC广播第四台今日节目：“这将允许学生得到他们的成绩并让大学录取工作在这个夏天得以开展。” 在问及那些已经被大学预录取的学生能否被无条件录取时，他表示：“这是可能的，这对于立即消除学生的不确定性是一个好的选择。” 关闭学校的决定受到教师工会的欢迎，但许多人要求政府公开更多的细节。 全国校长协会秘书长保罗·怀特曼说，有“很多复杂的问题需要处理”，以及“目前我们的问题多过于答案。” 家长们与BBC联系表达了他们的担忧，如果学生没有参加考试的话，预期的成绩可能会被当作GCSE和A-level的结果。 作为单亲或个体经营者的父母们同样担心如何应付。 贝尔法斯特的维多利亚说：“我是一个个体经营者，也是一对双胞胎的母亲，我没有收入，现在我不得不呆在家里照顾孩子们，钱从哪里来？” 与此同时，军队表示“正在暂停”基础训练，这将涉及把在哈罗盖特，皮比赖特，卡特里克和温彻斯特的数百名新兵遣送回家。然而，发言人称这不会影响军队作为“疾病支援力量”的一部分去提供公共服务的能力，这里只会包括那些已经通过基础训练的军人。 军队将会在整个流行病期间作为支援的一部分，处于高度准备状态的部队人数将会翻倍至两万人，并且预备队将处于待命状态。 国防部长也计划投入150名军事力量，训练他们驾驶全国范围内的氧气罐车以支援NHS。 在其他地方，环境部长乔治·尤斯蒂斯否定了在超市中强制保持社交距离的措施。 他告诉下议院：“意大利已经这么做了，在商店中严格限制人数，但他们发现这只会让数百人聚集在超市入口，这适得其反。” 议会将在稍后引入紧急法案，法案提供了新的权力以应对这次瘟疫。这项大范围的法案包括边境管制许可，增加NHS工作人数和简化死亡登记的方法。 政府表示新冠病毒法案里的措施是适当的，只会在必要的时候采用，且仅在两年内有效。 但工党要求每六个月对该法案进行一次合法性投票，由于这些措施是影响深远的。 首相也表示他不会排除在伦敦采取进一步限制的可能性，伦敦的病毒蔓延比英国其他地方更加快速。 在科学模型显示英国正步入“灾难性的大流行”之后，周一，首相宣布了一系列新的关键措施以针对新冠病毒病例数。 鲍里斯·约翰逊表示随后的决定去关闭学校对于延缓病毒进一步扩散是必要的。 周三英国死亡总数增加33例跃升至104例，确诊病例从周二的1950例增长至2626例。 英国针对COVID-19进行了56221例测试，政府表示计划在英格兰增加一倍以上的测试量至每天25000例。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"世卫主席警告“我们正处在未知区域”，随着世界范围内新型冠状病毒病例超过90000例","slug":"世卫主席警告“我们正处在未知区域”，随着世界范围内新型冠状病毒病例超过90000例","date":"2020-03-03T13:00:00.000Z","updated":"2020-03-03T13:00:00.000Z","comments":true,"path":"2020/03/03/世卫主席警告“我们正处在未知区域”，随着世界范围内新型冠状病毒病例超过90000例/","link":"","permalink":"https://ikeove.cn/2020/03/03/%E4%B8%96%E5%8D%AB%E4%B8%BB%E5%B8%AD%E8%AD%A6%E5%91%8A%E2%80%9C%E6%88%91%E4%BB%AC%E6%AD%A3%E5%A4%84%E5%9C%A8%E6%9C%AA%E7%9F%A5%E5%8C%BA%E5%9F%9F%E2%80%9D%EF%BC%8C%E9%9A%8F%E7%9D%80%E4%B8%96%E7%95%8C%E8%8C%83%E5%9B%B4%E5%86%85%E6%96%B0%E5%9E%8B%E5%86%A0%E7%8A%B6%E7%97%85%E6%AF%92%E7%97%85%E4%BE%8B%E8%B6%85%E8%BF%8790000%E4%BE%8B/","excerpt":"CNN 2020/03/03 , Original link","text":"CNN 2020/03/03 , Original link 截至周一晚上，新型冠状病毒在世界范围内已感染了73个国家和地区的9万多人，世卫组织负责人表示抗击病毒扩散的公共卫生官员们正在“未知的领域”战斗着。自去年十二月份在中国中部城市武汉首次发现病毒以来，已经传播到了除了南极洲以外的所有大陆。在韩国，伊朗和意大利的医务人员正与致命的疫情爆发群做斗争，同时其他国家正热切地通过卫生部门积极备战和提醒公民限制出行去往疫情爆发地区的手段来避免遭受同样的命运。 截至目前，报道已有172例中国大陆以外的死亡病例，全球死亡病例攀升至3115例。 一些出现病例的国家正在采取合理的方式来限制病毒扩散：例如关闭学校，鼓励远程办公和取消或者缩减公共活动等等。 世卫组织目前尚未将新冠病毒归类为全球流行病，但是警告说有可能在短期内上调。“我们之前从未发现一种能够社区性传播的呼吸道病原体，但只要方式正确依旧是可以被控制的，” 全球卫生监督机构总干事特德罗斯·阿德诺姆·盖布里亚苏斯博士说。 投资者们同样担心因COVID-19（病毒所导致疾病的正式名称）的扩散而导致全球经济陷入衰退的可能性。病毒在世界第二大经济体和主要制造国中国传播后，工厂的关闭严重影响全球供应链。 目前在中国大陆至少有80151人被确诊，2943人死亡。 然而，随着病毒对世界范围内的商业运营和消费行为产生影响，其在经济领域的伤害已经涉足到中国以外。经合组织周一警告说病毒将世界经济拉到了自2009年全球经济危机以来的最低点，并且如果疫情持续不减弱的话，经济增速可能会减半。 中国之外的主要疫区由于中国采取了数周的严格限制和紧急手段，让国内部分地区的疫情表现出逐渐稳定的迹象，因而使得中国之外的地区的疫情传播速度显得更加快速。世卫组织的葛布里在周一说：“过去的24小时里，中国之外的COVID-19病例报道数约九倍于中国内的。” 中国国家卫生委员会报告周一国内新增确诊病例为125例，其中114例来自于湖北。韩国，伊朗和意大利面临着除中国之外最严重的疫情。首尔当局周二表示超过4800人确诊，死亡28人。意大利官方报道至少1835感染病例和52人死亡。伊朗宣布至少1500例病例和66例死亡，包括最高领导人阿亚图拉·阿里·哈梅内伊的一名顾问。毗邻伊朗的一些国家已经采取措施阻止疾病蔓延，包括关闭与伊朗接壤的边界。 欧洲当局同样采取了早期预防措施。一些国家政府禁止大型集会以阻断社区传播，同时关闭了如巴黎的罗浮宫和米兰的斯卡拉剧院等公共区域。公共活动如巴黎半马也被取消。并且一位法国官员建议取消法国悠久的双面吻礼问候方式以避免亲密的身体接触。 欧盟委员会主席乌尔苏拉·冯·德·莱恩再周一的新闻发布会上说，欧盟已将新冠病毒的警告等级从中等调到了高级。欧盟的确诊病例已超过2000人，其中大部分发生在意大利。 美国的病例同样表现出上升趋势，在华盛顿一波新发病人的激增后，如今超过100名患者被确诊，6人死亡。死者中的四人是西雅图郊区柯克兰的一家护理机构的居民，这引起了对病毒可能在最近的几天或几周内已在华盛顿内传播的担忧。华盛顿依旧是美国境内唯一因病毒导致死亡的州。 新的病例促使私人企业采取他们自己的积极措施。推特要求雇员在家办公，嘉年华邮轮航班改变了一些行程，同时NBA要求球员避免从球迷那里拿东西来签名，以及对于陌生人用撞拳代替拍手。 目前，美国新冠病毒死亡人数至少有6人，超过100人患病。 然而，联邦公共卫生局发布了一系列呼吁要求冷静，美国外科专家杰罗姆·亚当斯医生说政府“知道疾病的进展”，“警惕是合适的，预防是合适的，但不需要恐慌”。 总统特朗普周一表示他会继续考虑针对新冠病毒大面积爆发的国家进一步的旅行限制。被任命为特朗普总统新冠病毒特别行动组的负责人的副总统迈克·彭斯称，新的合理的针对意大利和韩国的旅行政策已经发布，任何从意大利和韩国飞到美国的人在到达美国之前都会接受多次扫描检测。 但是他同样劝告美国人，表示病毒不会对他们形成严重威胁。“让我们弄清楚：根据我们所有同各国政府合作的专家们的意见来看，新冠病毒对于美国人的风险依旧很低。”","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"鲍里斯·约翰逊召开眼镜蛇会议后的更多信息","slug":"鲍里斯·约翰逊召开眼镜蛇会议后的更多信息","date":"2020-03-02T13:00:00.000Z","updated":"2020-03-02T13:00:00.000Z","comments":true,"path":"2020/03/02/鲍里斯·约翰逊召开眼镜蛇会议后的更多信息/","link":"","permalink":"https://ikeove.cn/2020/03/02/%E9%B2%8D%E9%87%8C%E6%96%AF%C2%B7%E7%BA%A6%E7%BF%B0%E9%80%8A%E5%8F%AC%E5%BC%80%E7%9C%BC%E9%95%9C%E8%9B%87%E4%BC%9A%E8%AE%AE%E5%90%8E%E7%9A%84%E6%9B%B4%E5%A4%9A%E4%BF%A1%E6%81%AF/","excerpt":"BBC 2020/03/02 , Original link","text":"BBC 2020/03/02 , Original link 英国首相鲍里斯·约翰逊在主持一项针对新型冠状病毒疫情的紧急眼镜蛇会议后，同BBC政治编辑劳拉·昆斯伯格进行了交谈。 他表示明天政府会宣布制定的竭力遏制疾病传播的计划，进一步的详情将会在接下来的几周公布。 “我认为强调新型冠状病毒的严重性是非常重要的，在接下来的几天或几周里，英国的新型冠状病毒可能会变得更加严重，因此我们需要为这种状况做好一切可能的准备。”鲍里斯指出。 “我们同样制定了计划以应对以上的状况，当病毒开始传播时（看起来病毒恐怕会这样），我们能有准备的更加合理的采取必要的措施，尽最大的努力去控制疾病扩散和保护广大的易感人群。” 约翰逊先生接着说：“为了支持我们的NHS,为了中止新冠病毒的扩散，我们能做的最有用的一件事情就是用热水和肥皂洗手，时间应该要有两次生日快乐歌那么长，”否则人们就得考虑商业行为是否能够一如既往了。 世卫组织同样建议人们将洗手时间拉到两次生日快乐歌那么长。 当被问及是否会采取关闭学校和其他方法控制蔓延时，约翰逊先生表示这些决策权将会交到科学顾问和英国主要医疗官员身上。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"病毒爆发重击经济，扩散的恐惧正在加剧","slug":"病毒爆发重击经济，扩散的恐惧正在加剧","date":"2020-03-01T13:00:00.000Z","updated":"2020-03-01T13:00:00.000Z","comments":true,"path":"2020/03/01/病毒爆发重击经济，扩散的恐惧正在加剧/","link":"","permalink":"https://ikeove.cn/2020/03/01/%E7%97%85%E6%AF%92%E7%88%86%E5%8F%91%E9%87%8D%E5%87%BB%E7%BB%8F%E6%B5%8E%EF%BC%8C%E6%89%A9%E6%95%A3%E7%9A%84%E6%81%90%E6%83%A7%E6%AD%A3%E5%9C%A8%E5%8A%A0%E5%89%A7/","excerpt":"APNEWS 2020/03/01 , Original link","text":"APNEWS 2020/03/01 , Original link 周日，全球感染数和死亡数持续增加，人们处于不知道快速传播的新病毒的爆发下一次将会在何处出现的恐惧中，街道空无一人，没有游客，没有上班族，经济受创，现实的日常生活也在被改变。在日本出现了对于生活日用品的恐慌性囤居，亚欧乃至中东的旅游胜地了无生机，政府关闭了学校并且禁止大型集会。游乐园关闭，音乐会取消。在巴黎，神父停止将圣餐面包放在信徒们的嘴里。 随着新型冠状病毒已触及到世界各地，伊朗，意大利和韩国感染人数明显上升，疾病在地理上的聚集已经明确出现。与此同时，美国也出现了第一例因病毒死亡记录，患者为五十多岁的男性，居住在华盛顿，之前身体健康，同时也没有任何已感染区域的旅行史。 “美国可能会有其他的一些感染病例，但健康的人应该有能力自我痊愈，”总统特朗普在周六的简报会上表示。同时官方宣布，高度警告通往意大利和韩国的感染区域，并禁止通往伊朗。 周六，中国报道过去24小时新增病例小幅度上涨至573例，这是五天来第一次数量超过500。其中绝大部分依旧限制在最大的疫区湖北和它的省会武汉。 遭受病毒感染的国家攀升至近60个。世界范围内超过86000人感染病毒，死亡人数超过2900例。 许多病毒感染者症状相对轻微，而且其中的一些感染者几乎不表现出任何症状。这使得病毒传播更加容易，同时越发担心延长的隔离期，中断的供应链以及旅游和商务出行的急剧减少会削弱全球经济甚至引起大衰退。 环顾整个世界，病毒及其引发的恐惧已经导致动荡。伊斯兰圣地面对外国朝圣者关闭，同时在日本，职业棒球比赛观众席空无一人；法国官员建议居民废弃问候时习惯性的吻礼。 在一支队伍呆过的韩国南部的一家旅馆被报道出一例感染之后，韩国男子职业篮球联盟宣布周日的常规赛会停止。 东京迪士尼乐园和日本环球影城宣布闭馆，大型活动取消，其中包括K-pop超级团体BTS的一系列音乐会。 在法国，巴黎大主教建议本教区神父不要将圣餐面包放在信徒的嘴里进行礼拜，转而放在他们的手上。 由于病毒引起的COVID-19疾病的蔓延，联合国秘书长安东尼奥·古特雷斯建议3月9号举行的联合国妇女权利协会25周年庆典原定的约10000参会人数应大幅度缩减。 在继中国之后的第二大疫区韩国，其总统在纪念反日本帝国主义独立战争的101年庆典上发言呼吁国民团结起来，共同战胜持续上升的病毒扩散。 就在总统文在寅讲话前不久，卫生署报道了376例新型冠状病毒新增病例，国内病例总数增至3526例。 日本北海道北部岛屿周日报告一名70多岁的男子死于病毒，这是日本第12例死亡病例。也是北海道在出现未知的群体性传播事件后，周五宣布紧急状态的同时已检出70人被感染的第3例死亡。 周日，泰国也宣布第一例死亡病例，死者35岁，男性，是一名销售人员，曾与外国游客接触。 意大利当局宣布目前有超过1100例新型冠状病毒病例，迄今已有29人死亡。 一名官员称，由于周六确诊病例数量再次上涨，伊朗正在为可能要对成千上万的人做病毒测试做准备。截至目前，伊朗因病毒引起的COVID-19疾病死亡的人数超过40人，有接近600人已确诊。 随着各国政府争相控制病毒蔓延和企业间竞争中断，研究者们能进行更好的理解这种疾病的研究，他们发现疾病的死亡率可能要低于一开始担心的那样，因为开始许多轻症病例没有被计算在内。周五，在新英格兰医学杂志上刊登了一篇中国学者的研究报告，在分析了全中国超过500家医院的1099名病例后，计算出死亡率为1.4%，大大低于早期针对最早发和最严重的区域武汉内的病例的研究结果。 考虑到仍有大量的病例没有表现或轻微表现症状，“这种疾病的致死率可能要低于1%，”美国卫生官员在该杂志的社论中写道。 这可能让这种新型病毒更加像严重季节性流感而不是它的基因上的表亲SARS，严重急性呼吸系统综合症，或者MERS，中东呼吸综合征。 越来越多的证据表明去年十二月份在中国中部出现的这种疾病造成了大量的投入和经济动荡。近来的一份报告显示，世界第二大经济体为了努力遏制病毒而大量停工后，二月份中国制造业急剧下降。这份报告出来的同时，全球股票市场因为担心病毒会国际间传播而急剧下跌。 日本首相安倍晋三宣布了一项2700亿日元（折合25亿美元）的紧急经济补助以帮助抗击病毒。安倍在一个新闻会议上表示日本正处在一个关键的节点，去确定这个国家能否在东京奥运会之前让疫情得到控制。 因关闭学校超过一个月而遭受批评的安倍称这个经济补助包含对于父母和他们受到疫情影响的雇主们的经济补偿。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"Map of CS -001","slug":"Map-of-CS-001","date":"2020-02-29T13:00:00.000Z","updated":"2020-02-29T13:00:00.000Z","comments":true,"path":"2020/02/29/Map-of-CS-001/","link":"","permalink":"https://ikeove.cn/2020/02/29/Map-of-CS-001/","excerpt":"Of five basic courses of computer science, most hard understanding for me is operate system of computer. It is not pure logical stuff but contains some of physical, jump from physical to logical always make me puzzle, and Principles of computer composition too.","text":"Of five basic courses of computer science, most hard understanding for me is operate system of computer. It is not pure logical stuff but contains some of physical, jump from physical to logical always make me puzzle, and Principles of computer composition too. Compare with them, it is easier to me that data structure, Microcomputer principle and computer network, because of they are only point to one side, physical or logical. I am stall in complex of logical and physical so long, so that I want to detach them and refactoring the structure. First I list key point of them and illustrate it. Then, blending similar technique to one, marking its facility, let logical be logical, let physical be physical. And descript how an order to work, what event it will encounter and where it will travel. From a simple Von Neumann’s machine to a complete modern computer, update hardware and upgrade software strategy, that make calculate faster. ATTACHMENT: CSMap","categories":[{"name":"creature","slug":"creature","permalink":"https://ikeove.cn/categories/creature/"}],"tags":[{"name":"FoCS","slug":"FoCS","permalink":"https://ikeove.cn/tags/FoCS/"}]},{"title":"市场在COVID-19的影响下跌宕回升","slug":"市场在COVID-19的影响下跌宕回升","date":"2020-02-26T13:00:00.000Z","updated":"2020-02-26T13:00:00.000Z","comments":true,"path":"2020/02/26/市场在COVID-19的影响下跌宕回升/","link":"","permalink":"https://ikeove.cn/2020/02/26/%E5%B8%82%E5%9C%BA%E5%9C%A8COVID-19%E7%9A%84%E5%BD%B1%E5%93%8D%E4%B8%8B%E8%B7%8C%E5%AE%95%E5%9B%9E%E5%8D%87/","excerpt":"ECONOMIST 2020/02/26 , Original link","text":"ECONOMIST 2020/02/26 , Original link 市场动荡会加剧经济瓦解吗？ 当全球资本中心的美国正处于一个长期的经济扩张和牛市中时，投资者们觉得左右为难。一方面觉得这样的好日子还会持续所以不愿意收回投资；另一方面他们也担心繁荣会突然结束。这是一种经济周期到达后期常有的心态，它会对贸易战，公司负债或一些其他的不安因素等这些偶发性事件造成的恐慌做出反应，但往往不会让投资者长期认真对待。 COVID-19就是市场稳定的严重威胁，2月24号意大利发布的亚洲外最大冠状病毒爆发的消息让美国标普500指数下降了3.4%，这是两年来最大的日降幅。25日继续崩盘。亚洲和欧洲交易所的下跌已经预示了这两天的崩盘。26号股市企稳。但面对这种不确定性，像周一（2月24日）的这种下跌可能还会有很多次。 聪明的投资者尝试去计算出哪些资产最容易收到冲击。遭受打击最严重的是那些依赖长供应链的公司的股票，例如汽车制造，电子公司；还有受旅行限制直接影响的公司，例如航空公司；以及那些最容易遭受中国主导的全球经济放缓影响的公司，例如石油公司。投资者们争相购买安全资产。25日，十年期美国国债收益跌至历史最低点1.31%。黄金价格上涨至七年新高。美元同步上涨。 但是病毒可能会引发更大的金融市场崩溃这种不安的感觉长时间剧烈增长，以至于危险的高风险持有必定会存在。最担心的两个问题是：不透明的金融工具大厦依赖低波动性，以及膨胀的信贷市场。 首先是波动性。交易市场的动荡可能会自发加剧。通过标普500指数的期权价格来衡量预期的波动性的VIX（Cboe volatility index）在几天内从15左右跃升至27以上。一些投资策略对此特别敏感。例如当波动性低时，投资机构将会让股票在投资组合中占有更大的权重。但当波动性上升且保持高位时，一些投资者会更倾向抛出一些他们手中的资产，从而造成更大的波动性。一些价值与VIX紧密相关的贸易交易基金会出现大量的资金流出。至少有一些大型对冲基金会继续押注在近乎沉睡的波动性上，但这些基金的效果如何还有待观察。 更大的忧虑则在信贷市场，尤其是公司债务在过去的十年中飙涨。借贷成本的急速上升会伤害那些需要展期（延期归还本息）到期债券的公司同时弄乱美国巨大但不透明的私人信贷市场。上一次全球增长恐慌发生在2018年末，引发了恐慌性的抛售并一度威胁要求信贷紧缩。迄今为止，投资者要求持有高收益公司股票利率与国库券的息差已扩大至四个百分点，其中大部分来自于能源行业债券的影响。这值得关注但并不是关键。关键是新的债券发行已经枯竭，据2月26日彭博社报道，华尔街已经三天没有任何的优质债券。如果情况持续下去，一家公司的流动性将会缩减。 降息对于弥补COVID-19造成的伤害不会有太大作用。但能够帮助缓解信贷市场。美联储的宽松政策在过去（尤其是1998年）为面对十分强大逆风的风险资产在周期末尾反弹提供了动力。两周前，市场即对于美联储的单次降息做出了反应。如今降息两次，一家法国银行，法国兴业银行的杰特·杰克斯表示：“如果关于COVID-19的消息没有关键性的转折，几周内我们可能会将利息降为三分之一，甚至四分之一。”","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"担忧愈增，中韩报道更多病例","slug":"担忧愈增，中韩报道更多病例","date":"2020-02-25T13:00:00.000Z","updated":"2020-02-25T13:00:00.000Z","comments":true,"path":"2020/02/25/担忧愈增，中韩报道更多病例/","link":"","permalink":"https://ikeove.cn/2020/02/25/%E6%8B%85%E5%BF%A7%E6%84%88%E5%A2%9E%EF%BC%8C%E4%B8%AD%E9%9F%A9%E6%8A%A5%E9%81%93%E6%9B%B4%E5%A4%9A%E7%97%85%E4%BE%8B/","excerpt":"APNEWS 2020/02/25 , Original link","text":"APNEWS 2020/02/25 , Original link 中韩在周二报道了更多的新冠肺炎病例，主要集中在北亚，但随着中东和欧洲病例的增长已经引发了全球的担忧。中国报道了508例新增和71例死亡，68名死者位于中部城市武汉，在去年12月疫情首次被探测到的地方。最新数据中国大陆累计77658例病例和2663例死亡。 韩国的977例病例当前位于世界第二，并且在报告的一周内感染人数翻了接近15倍，随着卫生人员在南部城市大邱及附近区域继续发现了成批的病例，恐慌让城镇陷入怪异的死寂。 韩国疾病预防和控制中心报告的144例新增病例中大部分来自于大邱及庆尚北道周边地区。 韩国同样报道了由病毒引发的COVID-19疾病的第十位死亡病例，其中包括一位与位于清道的一家医院有过接触的男子，该院的精神病科室被报道病人间有许多被感染。 韩国最大的航空公司大韩航空表示有一名机组成员病毒测试呈阳性，但并没有立即披露该名成员工作过的航班或路线的详细信息。 政府誓言要充分调动公共卫生工具去遏制大邱周边疫情的爆发，但表示不会限制旅行。所有的大邱市民都表现出感冒症状，估计大约有30000人将会进行病毒测试。韩国同时限制出口以解决全国口罩短缺。 卫生署期望在周三扩大测试范围之前，完成对耶稣新天地教会大邱支部的大约1300名有明显症状的成员的检测。 这座拥有韩国最大感染人群的教堂同意向当局提供它在全国200000名成员的名单，以便对其进行筛查，这可能要花费数月的时间。 “这是速度与时间的比拼，我们必须在本周内明确一个阻止确诊病例继续增长的转折点，”韩国总统文在寅在访问大邱市政厅期间提出，同时他承诺“全国范围”的支持，包括积极调动军队，警察和民用资源来抗击疫情爆发。 韩国病例数量如今已经超过日本游艇上的病例报告数，船上的病毒已经感染了近五分之一的乘客和船员。 基于病毒的考虑，以色列在周二安排包机将大约200名韩国游客遣返。 美国疾病预防与控制中心周一在它的最高旅游警告消息中建议美国人如非必要，不要去韩国。日本外交部劝告国民如非必要，不要去大邱和庆尚北道。 病例同样在伊朗和意大利出现，人们担心新的疫情可能标志着全球范围内的疾病蔓延进入了一个更严重的阶段。伊朗第二天就关闭了学校，并且开始了对公共巴士和被大约3百万人使用德黑兰地铁的每日消毒。 在周一报告首次病例的一些国家中，伊拉克，阿富汗，科威特，巴林和阿曼的感染者都与伊朗有接触。伊拉克和阿富汗关闭了它们与伊朗的边界以阻止疫情的进一步蔓延。 意大利有229人病毒检测阳性，7人死亡，随着整个大陆的担忧与日俱增，警察在十二个隔离的北部城镇周边设立了检查点。 奥地利暂时中止了越过边境通向意大利的铁路交通。意大利热门的度假地点斯洛文尼亚和克罗地亚正在举行危机会议。学校关闭，剧场表演取消，甚至在威尼斯的狂欢节庆典也被叫停。 随着疫情在多国爆发，世卫组织表示COVID-19虽然尚未但有成为全球性流行病的可能。 “过去的几周证明了一种新的病毒能在世界范围传播得多快，并且引起了大范围的恐慌与混乱，”世卫组织总干事特德罗斯·阿德诺姆·格布里耶苏斯说道。 但是，他继续说：“当前，我们并未见到这种病毒在全球脱离控制的蔓延。” 世界上绝大部分的COVID-19感染和死亡病例依旧在中国。周一，中国推迟了一年中最重要的政治会议，表明了习近平主席对于抗疫的重视，并将其视作他最大的政治挑战之一。 人大及其常委会年度会议通常在三月举行，期间数千代表将会来北京参加政治会议和提案。官方媒体指出，这些代表中的许多人正带领着奋战在抗疫前线。 韩国，新学期开学推迟，公司要求雇员居家工作。近来去过大邱及其周边地区的人被要求尽可能在家自我隔离两周。 韩国职业篮球联盟表示会禁止观众直到疫情被控制。釜山市提出原计划三月份举办的世界乒乓球锦标赛将被推迟到六月。 韩国军队确认已有13名士兵被感染，导致其他多名士兵被隔离以及停止野外训练。美国驻韩部队表示一名居住在大邱的61岁退休士兵的遗孀经病毒检测呈阳性，这是与驻韩美军有关的第一例感染。 由于疫情，盟军正考虑减少联合军事训练。 国防部长马克·埃斯珀和韩国国防部长郑京斗在华盛顿对记者说，病毒对于他们的年度训练计划是个威胁。 埃斯珀说，他有信心能找到一种方法来保护军队，同时也确保两国军队做好面对潜在威胁的准备。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"VPS使用记录-v2ray","slug":"VPS使用记录-v2ray","date":"2020-02-18T13:00:00.000Z","updated":"2020-02-18T13:00:00.000Z","comments":true,"path":"2020/02/18/VPS使用记录-v2ray/","link":"","permalink":"https://ikeove.cn/2020/02/18/VPS%E4%BD%BF%E7%94%A8%E8%AE%B0%E5%BD%95-v2ray/","excerpt":"V2ray的安装推荐脚本：","text":"V2ray的安装推荐脚本： bash &lt;(curl -s -L https://git.io/v2ray.sh) 此脚本支持TCP，HTTP/2，WebSocket，mKCP等多个传输协议，如果是在一部纯净的VPS上可直接使用脚本按提示配置即可。 然而这原本的机器上已经使用宝塔安装了LNMP，与脚本安装WebSocket+TLS使用nginx配置TLS有冲突，故而在安装带有TLS机制（例如WebSocket+TLS和HTTP/2）的传输协议时，不能使用脚本自动配置，而应该手动操作。 需要指出的是，受限于IOS客户端我购买的是QUANTUMULT，传输协议只支持WS和HTTP，因而实际上最终可选传输协议不多，在测试过程中，脚本的TCP_HTTP协议在IOS和WINDOWS端都可用，但是速度太慢，且没有TLS担心被Q（SSR的前车之鉴……），mKCP使用UDP无连接和快速重传机制，在速度上有了质的飞跃，可惜QUANTUMULT不支持，否则是一个很好的选择，安装也简便，不用考虑TLS配置。 执行命令yum install -y wget &amp;&amp; wget -O install.sh http://www.aapanel.com/script/install_6.0_en.sh &amp;&amp; bash install.sh，安装完宝塔和部署好网站后，准备一个已设置好解析到该VPS的域名，添加一个新的网站并绑定该域名，并开启SSL，接着在VPS执行v2ray安装脚本，按提示输入，选择不自动配置TLS，其余等均默认即可，选择WebSocket+TLS传输协议安装完成后，在v2ray的配置信息中需要注意的有地址，用户ID，额外ID和路径。 接着，在宝塔面板v2ray地址（域名）所绑定的网站里的配置文件中，在#SSL-END下加入 123456789101112131415location &#123;v2ray配置信息中的路径&#125; &#123;proxy_redirect off;proxy_pass http:&#x2F;&#x2F;localhost:&#123;安装v2ray时你输入的端口号&#125;;proxy_http_version 1.1;proxy_set_header Upgrade $http_upgrade;proxy_set_header Connection “upgrade”;proxy_set_header Host $http_host;&#125; 保存即可，至此，服务器端WebSocket+TLS安装完成。 至于CDN，由于cloudflare套上去会大大拖慢速度，国内的我不敢用，故而除非IP被Q，否则不推荐，有TLS做保障个人使用应该问题不大。 Windows客户端使用的是v2rayN，这只是一个UI壳子，方便使用，地址在github上找，另外还需要v2ray-core，这才是真正的项目文件，下载地址 （客户端和服务器是一样的，如果服务器（Linux）不是使用一键安装脚本，可以使用Project V的方法bash &lt;(curl -L -s https://install.direct/go.sh) 安装v2ray，接着手动修改/etc/v2ray/config.json文件配置。），然后将v2ray-core文件放到v2rayN的文件夹中，运行v2rayN.exe，然后添加VMess服务器，按提示输入相关参数即可，底层传输安全记得选TLS。至于PAC规则，使用默认或自行搜索相关策略都行。 IOS客户端使用的是QUANTUMULT（国区已下架），设置里添加VMess服务器，打开传输和TLS，其中传输的类型有两个，http即一键安装脚本中的TCP_HTTP，ws则是WebSocket+TLS所需要的，TLS里的验证选0，其余按提示填写或默认即可。 使用后体验，稳定性比SSR要好很多，但是WebSocket+TLS新建连接时所需要的握手时间有点长，刚开始会有断线感觉的不适应，这一点不如mKCP，速度上也稍逊一筹。 Project V项目的官方手册","categories":[{"name":"creature","slug":"creature","permalink":"https://ikeove.cn/categories/creature/"}],"tags":[{"name":"tool","slug":"tool","permalink":"https://ikeove.cn/tags/tool/"}]},{"title":"VPS使用记录-SSR","slug":"VPS使用记录-SSR","date":"2020-01-24T13:00:00.000Z","updated":"2020-01-24T13:00:00.000Z","comments":true,"path":"2020/01/24/VPS使用记录-SSR/","link":"","permalink":"https://ikeove.cn/2020/01/24/VPS%E4%BD%BF%E7%94%A8%E8%AE%B0%E5%BD%95-SSR/","excerpt":"SSR使用起来就简单多了，找到三个脚本可用：","text":"SSR使用起来就简单多了，找到三个脚本可用： 描述 链接 SSR独立安装版 wget –no-check-certificate https://raw.githubusercontent.com/teddysun/shadowsocks_install/master/shadowsocksR.sh SS-LIBEV，SSR等四合一版 wget –no-check-certificate -O shadowsocks-all.sh https://raw.githubusercontent.com/teddysun/shadowsocks_install/master/shadowsocks-all.sh SSR带中文配置管理版 wget -N –no-check-certificate https://raw.githubusercontent.com/ToyoDAdoubi/doubi/master/ssr.sh 好处就是服务器安装非常简单，且支持OpenVZ，坏处么，一是客户端需要第三方软件，尤其是IOS的需要切换国外商店，并且大多收费；二就是太流行且容易上手，导致被Q的概率很高。 SSR通常是和BBR加速器一起用的，下面是OpenVZ架构的BBR加速脚本： wget https://github.com/tcp-nanqinlang/lkl-rinetd/releases/download/1.1.0/tcp_nanqinlang-rinetd-centos.sh 实测可用，但是做了一下测试似乎提升不大，非OpenVZ的BBR以上四合一脚本自带，比较好找。 推荐的SSR配置为加密AES-128-ctr，sha_v4，http_simple，或者none，chain_a，http_simple，混淆参数加上一些常用网址做干扰，不过最近一段时间时常断流，基本不能用，还被Q了一部机。 之后考虑用cloudflare做CDN加速来拯救一下被Q机，但一来加CDN时延会增加，二来这个VPS也快到期，于是懒得折腾了。 但本着物尽其用的原则，就用跳板机SSH上去像跑一下Fswap，结果装DLIB的时候内存不足，还因为OpenVZ没法用swapon，这个时候才知道OpenVZ为啥这么便宜了…… 下一步，就试试V2ray。","categories":[{"name":"creature","slug":"creature","permalink":"https://ikeove.cn/categories/creature/"}],"tags":[{"name":"tool","slug":"tool","permalink":"https://ikeove.cn/tags/tool/"}]},{"title":"VPS使用记录-Virtual Private Network","slug":"VPS使用记录-Virtual-Private-Network","date":"2020-01-17T13:00:00.000Z","updated":"2020-01-17T13:00:00.000Z","comments":true,"path":"2020/01/17/VPS使用记录-Virtual-Private-Network/","link":"","permalink":"https://ikeove.cn/2020/01/17/VPS%E4%BD%BF%E7%94%A8%E8%AE%B0%E5%BD%95-Virtual-Private-Network/","excerpt":"18年之后，lantern和psiphon基本上就处于瘫痪状态，偶尔回光返照，恰好听朋友推荐搬瓦工，所以花点时间鼓捣了一下。","text":"18年之后，lantern和psiphon基本上就处于瘫痪状态，偶尔回光返照，恰好听朋友推荐搬瓦工，所以花点时间鼓捣了一下。 一开始是买了个KVM，配置丐版，服务三无，但是遭不住便宜，找了个L2TP/IPSEC配置脚本直接就上手了， wget –no-check-certificate https://raw.githubusercontent.com/teddysun/across/master/l2tp.sh 使用后的体验就像，下午八点半的移动宽带，绿皮火车哐叱哐叱，而且时常掉线，当时还考虑是美机不稳定，换成港机也并无好转，查了些信息才发现，14年GWF就针对L2TP做了特别照顾，没被Q估计还得感谢为验证机器正常运行而随手发布的apache页面，亦或者是连接时间不长懒得管。 后续了解了一些与之相关的一些协议，做了一下梳理： 加密协议 优势 缺点 备注 PPTP（不推荐） 全平台，易于安装，计算量小速度快 非常不安全，已被NSA破解，易于封锁 本身只是通讯协议，数据安全性由其他验证方式提供，要求TCP端口1723和GRE协议 L2TP（不苛求数据绝对安全的情况下可用，也推荐那些不支持OpenVPN的传统设备） 通常被视为安全，易于安装，所有现代平台可用，比OpenVPN更快，能对抗严格防火墙 可能已被NSA破解，似乎被NSA刻意削弱，经常执行错误 协议本身不提供加密，而是使用IPsec验证套件协助，且只能用部分端口，所以面对NAT防火墙会容易被封锁，L2TP/IPsec压缩数据两次，但是用内核加解密且支持多线程，所以理论上快于OpenVPN，PSKs只用来授权连接，加密则用其他例如AES SSTP（微软垄断，不推荐使用） 非常安全，windows完全整合，微软支持，能越过大多数防火墙 微软完全拥有专利标准 使用SSL3.0的加密方式，可以使用TCP端口443，在windows平台上最稳定 IKEv2（针对移动设备比OpneVPN更合适） 快，稳定，特别当网络切换或重连时，安全（只要使用AES），容易安装（至少在用户端），支持黑莓设备 许多平台不支持，服务器端安装很麻烦，容易导致一些潜在的问题，只有开源实现才是可信的 早期由微软和思科共同开发，支持windows7+，黑莓，IOS设备，但要小心微软开发的东西，所以只有支持Linux和其他操作系统的独立开发兼容版本的IKEv2才是值得信任的，IKEv2时IPsec协议套件的一部分，通过处理SA来保证流量安全，适用于移动设备。比L2TP更优秀。 OpenVPN（推荐使用，综合考量下最好） 非常安全（只要使用PFS），高度可配置，开源，能越过防火墙 需要第三方软件 使用OPENSSL库和TLS协议，可在任意端口运行，包括TCP端口443，最好是在UDP端口运行，可以使用OPENSSL库提供加密支持，OpenVPN加密包含两部分，数据频道加密和控制频道加密，保护数据安全和连接安全。 原文链接 正当我准备换IKEv2试一下的时候，VPS老板跑路了…… 于是换了另外一家，可惜是OpenVZ架构，Virtual Private Network似乎是玩不成了，下一步，部署SSR试试。","categories":[{"name":"creature","slug":"creature","permalink":"https://ikeove.cn/categories/creature/"}],"tags":[{"name":"tool","slug":"tool","permalink":"https://ikeove.cn/tags/tool/"}]},{"title":"Airport summary","slug":"Airport-summary","date":"2020-01-15T13:00:00.000Z","updated":"2020-01-15T13:00:00.000Z","comments":true,"path":"2020/01/15/Airport-summary/","link":"","permalink":"https://ikeove.cn/2020/01/15/Airport-summary/","excerpt":"ipsec/l2tp easy to deploy and apply on phone and pc, but it cannot work or disconnect before 2020.","text":"ipsec/l2tp easy to deploy and apply on phone and pc, but it cannot work or disconnect before 2020. ss/ssr has open client on windows, but charge for ios, and the combination of ctr, sha_v4 and http_simple make ip had been block today, maybe using cloudflare CDN to transfer my domain is a solution, but the way will add time of delay. v2ray is the next way, or trying other combination, example of cfb, origin and http_simple.","categories":[{"name":"creature","slug":"creature","permalink":"https://ikeove.cn/categories/creature/"}],"tags":[{"name":"tool","slug":"tool","permalink":"https://ikeove.cn/tags/tool/"}]},{"title":"杀死伊朗最高将领不会让美伊四十多年的战争停止","slug":"杀死伊朗最高将领不会让美伊四十多年的战争停止","date":"2020-01-05T13:00:00.000Z","updated":"2020-01-05T13:00:00.000Z","comments":true,"path":"2020/01/05/杀死伊朗最高将领不会让美伊四十多年的战争停止/","link":"","permalink":"https://ikeove.cn/2020/01/05/%E6%9D%80%E6%AD%BB%E4%BC%8A%E6%9C%97%E6%9C%80%E9%AB%98%E5%B0%86%E9%A2%86%E4%B8%8D%E4%BC%9A%E8%AE%A9%E7%BE%8E%E4%BC%8A%E5%9B%9B%E5%8D%81%E5%A4%9A%E5%B9%B4%E7%9A%84%E6%88%98%E4%BA%89%E5%81%9C%E6%AD%A2/","excerpt":"CNN 2020/01/05 , Original link","text":"CNN 2020/01/05 , Original link 作者：迈克尔·威尔 迈克尔·威尔是前时代杂志和CNN驻巴格达通讯记者在2003-2009 哈梅内伊的顾问：伊朗将会回敬美国以军事行动美国总统特朗普说他下令执行周五对伊朗最高将领卡西姆·苏莱曼尼的暗杀行动是为了“止战”，这显然是无稽之谈。 战争并未停止，特朗普却称之为是德黑兰的虚张声势，同时孤注一掷于数年来日益激烈的冲突中美国最大胆的一次行动。 从未有过美国总统如此这般的对德黑兰进行战斗，胆大妄为且充满挑衅意味，这可能会令中东局势再度紧张，但绝不会制止战争。 长达几十年的战争为什么战争不会停止？因为美伊之间的战争已经打了40多年， 这不是什么秘密，仅仅只是大多数美国人不知道他们正处在与伊朗的战争中，他们看不到战争，自然也就不认为战争正在发生。 周五的无人机打击干掉苏莱曼尼不过是世代交替中过度磨损，蜿蜒漫长的杀人冲突道路上的又一次颠簸而已。 战争起源故事需要追溯到1953年，那时伊朗人相信美国是真的主动挑起这场战争。 在1953年，美国在伊朗导演了一场政变，让一位受欢迎的，世俗化的且民族主义的总理下台，却让沙阿这位放纵的君主掌权。 正是美国发动的政变导致了1979年的革命，使阿亚图拉登上王位，到今天毛拉的统治依旧持续，正是刚刚死亡的苏莱曼尼将军效命的那一位毛拉。 当伊朗人叛乱对抗沙阿时，叛军攻克了在德黑兰的美国大使馆，抓获了许多美国外交官和海军陆战队员作为人质，并在国际电视台中展示他们，一如好莱坞在2012年拍摄的电影“逃离德黑兰”中表现的那样。 从那时起战争便开始了，而不是从这周的无人机打击开始。 在1983年，伊朗炸毁了美国驻贝鲁特大使馆内的一个海军陆战队的营房，杀死了数十人。 总统罗纳德·里根放弃了黎巴嫩，这显示伊朗已将美国赶出了此地区。 同年，一位名叫阿布·马赫迪·穆汉迪斯的伊拉克男子驾驶汽车炸毁了美国驻科威特大使馆。 尽管当时他在伊朗的帮助下脱逃，但在科威特对于爆炸案的审判中因缺席而被判处死刑，据信他随后继续参与了劫持客机。 西方情报机构也指控他涉及1984年的科威特客机劫案以及试图暗杀一位科威特王子。 你想知道周五无人机导弹打击时谁在苏莱曼尼将军的护卫队里吗？正是那位汽车爆炸者穆汉迪斯。 穆汉迪斯，又称为贾迈勒·贾法尔·穆罕默德，曾两次当选独裁者萨达姆·侯赛因倒台后由美国创建的民主伊拉克议会议员。 在伊拉克他是苏莱曼尼麾下的头号人物，身处议会，就在美国军队的鼻子底下。 CNN透露了穆汉迪斯的身份，一无所知的美国政府一开始却不相信CNN。 但当美国政府调查并确认他们大使馆爆炸者的确在议会时，穆汉迪斯已经逃离巴格达边境前往伊朗。 穆汉迪斯于周五在伊拉克这个几乎完全被一位伊朗将军操控的国家的巴格达机场迎接苏莱曼尼。 苏莱曼尼的飞机刚刚降落，他与在护卫队中的穆汉迪斯一起准备离开机场时就被无人机攻击，双双殒命。 一个屠夫，而不是一名恐怖分子毫无疑问，苏莱曼尼是一个屠夫，一名精于算计，耐心且复杂的杀手，不容辩驳地，他策划了许多美国人的死亡。 但是，不管特朗普总统怎么说，苏莱曼尼不是一名恐怖分子。他赞助，训练，武装了恐怖分子。但苏莱曼尼从本质来说是个军人。 他经历过二十世纪八十年代两伊战争的残酷。这是一战的现代化版本，化学武器攻击，自杀式的人潮攻击，以及一场我们再也不希望在这个世界上看到的杀戮事件。 苏莱曼尼在军队中步步高升，直到他成为即使不是整个世界，也无疑是这个地区最精锐的特种部队武装的首领，这支部队被称为圣城部队，也被翻译为耶路撒冷部队。 伊朗包含海军和空军力量一共有两支军队。一个用于保卫国家，另一个，伊朗革命卫队（IRGC），则用于保卫这个国家的宗教革命。 而纵观整个伊朗革命卫队，圣城部队是精英中的精英，成员掌握多种语言。 他们是间谍，战士和技术专家。在西方看来，他们是绿色贝雷帽，SAS突击队和三角洲武装部队的结合体。 而苏莱曼尼作为他们的指挥官超过20年。 他在美国人，阿拉伯人，以色列人，英国人之间游刃有余。 让我们非常非常确信的是：这个男人坚定地反对美国及其代表的一切事物。 他渴望摧毁整个以色列，使其不复存在，并且他反对当前中东的权力平衡。 他的整个一生都致力于将以色列及美国的一切毁灭。 如果你质疑苏莱曼尼的信条，他将以独特地暗杀作为回应。 华盛顿清楚他的危险性，这就是为什么特朗普总统下令无人机攻击。 苏莱曼尼为塑造及重塑该地区的格局所作的努力比任何国王，王子，苏丹，总统或总理都要多。 这个男人，无疑，是历史的力量。 他只是不与我们为友。 他的遇刺会改变伊朗的战略野心吗？不。 会让他们放缓吗？可能吧。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"在圣诞和新年致辞中普京再度邀请特朗普访问莫斯科","slug":"在圣诞和新年致辞中普京再度邀请特朗普访问莫斯科","date":"2019-12-31T13:00:00.000Z","updated":"2019-12-31T13:00:00.000Z","comments":true,"path":"2019/12/31/在圣诞和新年致辞中普京再度邀请特朗普访问莫斯科/","link":"","permalink":"https://ikeove.cn/2019/12/31/%E5%9C%A8%E5%9C%A3%E8%AF%9E%E5%92%8C%E6%96%B0%E5%B9%B4%E8%87%B4%E8%BE%9E%E4%B8%AD%E6%99%AE%E4%BA%AC%E5%86%8D%E5%BA%A6%E9%82%80%E8%AF%B7%E7%89%B9%E6%9C%97%E6%99%AE%E8%AE%BF%E9%97%AE%E8%8E%AB%E6%96%AF%E7%A7%91/","excerpt":"CNN 2019/12/31 , Original link","text":"CNN 2019/12/31 , Original link 华盛顿消息—周一克里姆宫一则普京对外国领导人的假日问候的发言稿发布，俄罗斯总理弗拉基米尔·普京再度邀请美国总统唐纳德·特朗普来年访问莫斯科。 “在对美利坚合众国总统唐纳德·特朗普的圣诞和新年问候中，弗拉基米尔·普京指出俄罗斯和美国对确保全球安全稳定负有历史性的责任，莫斯科支持双边关系正常化和展开基于共同利益前景的平等对话交流，”发言稿提到，“俄国总理再一次邀请唐纳德·特朗普访问莫斯科，参加伟大卫国战争胜利75周年庆典。” 周日克里姆宫发布了一篇特朗普和普京在一次通话中讨论了共同利益问题和继续双边合作打击恐怖主义达成一致的特别报道之后，普京的善意和邀请如约而至。 这则由俄罗斯发起的通话是七月以来普京和特朗普的首次交流，克里姆宫关于这则通话的报道中指出：“弗拉基米尔·普京感谢唐纳德·特朗普通过特殊的渠道共享信息为阻止在俄罗斯的恐怖活动提供了帮助。”但并未言及美国提供的是何种信息的额外细节。 俄罗斯联邦安全局发布的一份声明中表示，在美国提供的信息帮助下于周五被拘捕的两名俄国公民，计划在新年前夕对圣彼得堡实行恐怖袭击。 白宫在周一发布的关于这则通话的发言稿中指出，普京为美国提供的信息帮助阻止了在俄罗斯的一次潜在的节日恐怖袭击而向特朗普表示感谢。 “两位领导人就两个国家的长期反恐合作已达成一致，”白宫发言人霍根·吉德利在一次声明中指出，“就两国关系状态以及未来支持大规模杀伤性武器管控的方案双方同样展开了讨论。” 自特朗普上任以来他和普京之间异乎寻常的友谊就成为严格审查的重点，去年，当他拒绝承认美国政府对于俄罗斯干涉2016年美国总统大选的指证并且再三驳回普京对反对者实行暴力镇压行为的可信指控时，就被视为普京盟友。 11月，特朗普说他曾考虑接受普京的邀请参加胜利日游行，这是莫斯科在五月初举办的被视为在二战期间盟军战胜纳粹的胜利纪念日中展示俄罗斯军事力量的庆典。 “我被邀请了，我正在考虑，正处于我们竞选季的中期，但是我真的有认真的考虑要不要去参加，”特朗普当时说。 “普京总理邀请了我，这是件大事，庆祝战争的结束，所以我很荣幸收到这份邀请，”他补充道，“有机会的话我很乐意去。” 上一次美国总统访问俄罗斯是在2013年，时任总统巴拉克·奥巴马参加在圣彼得堡举办的G20经济峰会，前任总统乔治·布什参加了2005年举办的纪念战胜纳粹60周年胜利纪念日上的游行。 2020年五月的游行会在75周年纪念日举办。1995年，时任总统比尔·克林顿去俄罗斯参见了胜利日庆典，为了抗议俄罗斯在车臣事件中使用武力，克林顿和世界其他国领导人抵制莫斯科阅兵，之后他参加了没有军事装备出场的红场游行。","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"弹劾永远的改变了特朗普的政治遗产","slug":"弹劾永远的改变了特朗普的政治遗产","date":"2019-12-19T13:00:00.000Z","updated":"2019-12-19T13:00:00.000Z","comments":true,"path":"2019/12/19/弹劾永远的改变了特朗普的政治遗产/","link":"","permalink":"https://ikeove.cn/2019/12/19/%E5%BC%B9%E5%8A%BE%E6%B0%B8%E8%BF%9C%E7%9A%84%E6%94%B9%E5%8F%98%E4%BA%86%E7%89%B9%E6%9C%97%E6%99%AE%E7%9A%84%E6%94%BF%E6%B2%BB%E9%81%97%E4%BA%A7/","excerpt":"APNEWS 2019/12/19 , Original link","text":"APNEWS 2019/12/19 , Original link 总统特朗普讣告的第一笔已经被写下 虽然特朗普几乎确定会避免被罢免，但是在周三他成为美国历史上第三位被众议院弹劾的总统已经变成他政治遗产的一部分。 周三通过的两条符合党派立场的弹劾条款作为一种宪法性的斥责将始终与特朗普同在，尽管他试图去消解条款的含义并且利用它们去增加他的连任筹码。 “回顾这一任期不讨论弹劾是不可能的，这将和特朗普的记录永久相连，”普林斯顿大学总统历史学者朱利安·泽莱泽说，“如今特朗普成为滥用总统权力话题的一部分，乌克兰将成为他的水门，他的莱文斯基。” 【注：尼克松的水门窃听事件，克林顿与白宫实习生莱文斯基的性爱事件】 史书同样会把特朗普加入到这一章节，记录了距今21年前的比尔·克林顿因在与白宫实习生莫妮卡·莱文斯基的性爱事件的宣誓中撒谎而被弹劾，和151年前的安德鲁·约翰逊在重建中对抗国会而被弹劾，以及理查德·尼克松在水门事件调查中为避免被弹劾而辞职。 特朗普本人非常清楚弹劾可能会对他的政治遗产造成的影响。 近几个月来，其盟友描述特朗普对这一前景的愤怒，认为弹劾被更多的作为人身攻击和一种使其任期失去合法性的尝试而不是针对于其行为的评判。周二，特朗普表示他对于将到来的弹劾负有“零”责任。 “很少有身居高位的人可以忍受或通过这种考验，”在弹劾前夜特朗普写给众议院议长南希·佩罗西一封长达6页言词激烈的信中他写道，“你既不了解也毫不关心，这种强加在我优秀的和亲爱的家人身上的伤害和痛苦。” 这封信伴随着众多的感叹号，随意的大写，大量的委屈，将总统描绘为一个遭受不公平和包含政治动机的攻击的受害者。 “百年以后，当人们回顾这场事件时，我希望他们能理解并从中汲取教训，以免这一事件在其他总统身上再度发生。”特朗普写道。 由于共和党掌控着参议院，特朗普在明年一月的审判中无疑会被无罪开释。 特朗普确信一场针对弹劾的大众反馈或许能通过激发忠诚的支持者以及吸引更多的独立人士加入他的阵营从而在政治上有帮助，他谋划着举办一场判决胜利后的巡回，一场名副其实的“无罪之旅”，类似于他在2016年总统过渡时期导演的”感谢之旅“。 总统历史学者乔恩·米奇姆表示弹劾将会使特朗普成为“美国历史上第一位叛乱的在任总统”，他比较了当前的反身性党派之争和19世纪围绕在乔纳森和重建周围的部落主义，要求一个分裂的国家“去评估说的是什么而不是简单的致敬说这话的人”。 唯一能引起注意的是，特朗普对于被接纳的共和党保持了影响力，并重塑了共和党的形象，尽管同时也在对抗着政党正统。他通过他对抗性的风格和强硬的言辞使得他的基础支持者们兴奋不已，使用他好战性的推特账号去同政治反对者们战斗并且对于一开始关于外国干涉选举的指控而对特别顾问罗伯特·穆勒的俄罗斯调查进行了抗议。 尽管特朗普在没有发生权力更迭的情况下逃过了那一幕，但乌克兰事件的速度令白宫震惊以至于淹没了华盛顿，特朗普以相同的战略回应–否认，拖延，谴责–但依旧无法避免一个掌控在民主党之手的众议院的弹劾调查。 周三总统高级顾问凯莉安·康韦反驳了那些特朗普相信他的政治遗产会因弹劾而被玷污的说法。 “不，他没有，”康韦说，“特朗普将弹劾视之为那些专心且恶毒的想要将他赶下台的人的政治遗产的污点。” 克林顿为他的行为道歉，尼克松退位，但特朗普依旧未屈服，坚持他与乌克兰总统有一通“完美”的通话的说法，特朗普同许多他的共和党支持者们驳斥了一群政府证人的证词，这些人证实特朗普在努力推动基辅去调查其潜在的总统选举对手乔·拜登。 在密歇根的一场集会上，众议院开始它的历史性投票开始的几分钟，特朗普尝试公开淡化他记录上的污点。 “这是一场劣质弹劾，与理查德·尼克松一起，我能看到它作为一个非常黑暗的时代，”特朗普说，“我不知道你，但我很开心，而且我也知道在共和党中我们有一大群人的支持。” 总统支持率在弹劾调查期间大体上没有变化，他好斗的个性和民粹主义帮助他稳固对支持者的把握。 极度分化环绕在弹劾周围并不新奇，但是这次激烈的党派纷争因这一时刻独特的方面而加剧：特朗普追求连任，但克林顿和尼克松当他们面对弹劾的威胁的时候都中断了第二任期。 选举的结果可能决定最终历史会如何记住发生在特朗普身上的这次弹劾。 “唐纳德·特朗普如今成了弹劾的代名词，没有办法将之视之为荣耀奖章，它是一枚耻辱的徽章，”莱斯大学总统历史学者道格拉斯·布林克利说， “但是如果他赢了，弹劾将不再重要，这意味着特朗普藐视弹劾，并且用他自己的形象重铸了现代共和党，同时保持了他们的忠诚。”","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"}]},{"title":"Do not go gentle into that good night","slug":"Do-not-go-gentle-into-that-good-night","date":"2019-11-17T13:00:00.000Z","updated":"2019-11-17T13:00:00.000Z","comments":true,"path":"2019/11/17/Do-not-go-gentle-into-that-good-night/","link":"","permalink":"https://ikeove.cn/2019/11/17/Do-not-go-gentle-into-that-good-night/","excerpt":"Dylan Thomas","text":"Dylan Thomas Do not go gentle into that good night,Old age should burn and rave at close of day,Rage, rage against the dying of the light. Though wise men at their end know dark is right,Because their words had forked no lightning they,Do not go gentle into that good night. Good men, the last wave by, crying how bright,Their frail deeds might have danced in a green bay,Rage, rage against the dying of the light. Wild men who caught and sang the sun in flight,And learn, too late, they grieved it on its way,Do not go gentle into that good night. Grave men, near death, who see with blinding sight,Blind eyes could blaze like meteors and be gay,Rage, rage against the dying of the light. And you, my father, there on the sad height,Curse, bless, me now with your fierce tears, I pray.Do not go gentle into that good night.Rage, rage against the dying of the light.","categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"}],"tags":[{"name":"arts","slug":"arts","permalink":"https://ikeove.cn/tags/arts/"}]}],"categories":[{"name":"record","slug":"record","permalink":"https://ikeove.cn/categories/record/"},{"name":"creature","slug":"creature","permalink":"https://ikeove.cn/categories/creature/"}],"tags":[{"name":"news","slug":"news","permalink":"https://ikeove.cn/tags/news/"},{"name":"tool","slug":"tool","permalink":"https://ikeove.cn/tags/tool/"},{"name":"resource","slug":"resource","permalink":"https://ikeove.cn/tags/resource/"},{"name":"FoCS","slug":"FoCS","permalink":"https://ikeove.cn/tags/FoCS/"},{"name":"arts","slug":"arts","permalink":"https://ikeove.cn/tags/arts/"}]}